{"panels":{"4":{"info":{"title":"Welcome to Silent Hill","description":"Prepare to enter a world where all your worst fears become reality. I just have one question for you. Do you have what it takes to survive?"},"data":{"time":0,"tags":["Fan","Discussion"]},"speakers":["LinzyTakahashi","MinaHendo","KeraOtaku"]},"7":{"info":{"title":"Sailor Moon Mania","description":"This is a panel dedicated to everyones favorite soldier of justice, Sailor Moon."},"data":{"time":0,"tags":["Humor","Fan","Discussion"]},"speakers":["LinzyTakahashi","MinaHendo","KeraOtaku"]},"8":{"info":{"title":"Welcome to Phantomhive Manor","description":"This panel is all about the anime Black Butler. Trust me, you're not gonna want to miss this."},"data":{"time":0,"tags":["Humor","Fan","Discussion"]},"speakers":["LinzyTakahashi","MinaHendo","KeraOtaku"]},"12":{"info":{"title":"Fullmetal Alchemist fan panel","description":"Where fans of FMA can come together."},"data":{"time":0,"tags":["Humor","Fan","Discussion"]},"speakers":["AudiePritchett","BryceNelson"]},"13":{"info":{"title":"Homestuck Dating Panel","description":"Ever wanted to date a troll? well now you can as Nepeta herself leads a wonderful date panel and assists you in your love life! Audience members will be participating if you would like. its that simple write questions for our hat for Nep to ask our dates and participate in the dating part if chosen! XD So come try to ship yourself with your favorite troll and remember we ship it like fedex!"},"data":{"time":0,"tags":["Humor","Cosplay","Fan"]},"speakers":["CosplayEverything","BizYoung","Mira(AiAnimeCosplay)"]},"14":{"info":{"title":"Homestuck Truth or Dare","description":"It will just be with a Homestuck truth or dare panel, nothing so serious. It will be PG-13 so kids can come and have fun to."},"data":{"time":0,"tags":["Humor"]},"speakers":["KelaBlackfox"]},"15":{"info":{"title":"Do Fairies Have Tails","description":"So, you think you've got what it takes to join the most powerful guild in Fiore? Or maybe you've just got some questions you need answered from the most powerful team of Fairy Tail. Join Erza Scarlet, Natsu Dragneel, Lucy Heartfilia, and Juvia Lockser, as we discuss the power and might of Fairy Tail."},"data":{"time":0,"tags":["Humor","Fan"]},"speakers":["TiffanyShafer","TerriMcGuire"]},"17":{"info":{"title":"Lets Go Xiaolin Showdown!","description":"Random talk about Xiaolin Showdown and Q & A with Jack Spicer"},"data":{"time":0,"tags":["Humor","Discussion"]},"speakers":["RavenMichaelis"]},"18":{"info":{"title":"Let's Talk Final Fantasy","description":"A fan panel to discuss all things final fantasy hosted by Lightning Farron!"},"data":{"time":0,"tags":["Fan","Discussion"]},"speakers":["RavenMichaelis"]},"20":{"info":{"title":"Cosplay Wigs 101","description":"New to cosplay or just curious about wigs? Bring your notepad! This panel is the place for you! We'll be going over basic wig cutting techniques, as well as where to find the perfect wig and what supplies you'll be needing. Cosplay greenhorns welcome!"},"data":{"time":0,"tags":["Cosplay"]},"speakers":["SpencerParks"]},"22":{"info":{"title":"Japanese Fashion 101","description":"Street Style Fashionsta and Lolita coming together to show and teach you about the different Japanese Fashion trends in Japan! We discuss from the beginning of the Fashion storm in Japan to the present, Online Websites, and  to where some of the styles pop up at. We are also going to do drawing from a basket of goodies we have made ourselves to little accessories we have bought from our favorite online shops! We will also answer any question to how to start going into fashion style you like the most! We hope to see you there!"},"data":{"time":0,"tags":["Fan","Discussion","Culture"]},"speakers":["KrystalLong","GerranCoppin"]},"23":{"info":{"title":"Dollfie 101 and Meet Up","description":"Get to know your local dollfie enthusiasts, mingle with other doll owners and get some basic information dollfie. It is a joint project between the Central Oklahoma Ball Jointed Divas and DOT - The Dollfie Organization of Tulsa and we will be on site all weekend for more fun and prizes, so come and see us!"},"data":{"time":0,"tags":["Fan","Culture"]},"speakers":["AliciaGibson","KeaSnyder","JenniferBeacham"]},"24":{"info":{"title":"Dollie FIrst Aid","description":"Do you have questions on maintaining your doll? Are they too floppy? Too tight? Don't hold a pose well? This panel will answer all of your questions about maintaining your doll and will have hands on assistance and demonstrations on the different aspects of caring for your dollfie. We will be available to assist with stringing and sueding, however it will be first come, first serve and we ask that you only bring us one problem doll per person so that we will have a chance to assist others as time allows."},"data":{"time":0,"tags":["Fan","Culture"]},"speakers":["AliciaGibson","KeaSynder","JenniferBeacham"]},"25":{"info":{"title":"BJD Slumber Party","description":"Bring your dolls decked out in their best sleeping attire and mingle with other owners until the wee hours of the morning. Well, not really. Just until the Convention Center kicks us out."},"data":{"time":0,"tags":["Fan","Culture"]},"speakers":["AliciaGibson","KeaSnyder","JenniferBeacham"]},"26":{"info":{"title":"Dollfie Meet n Swap","description":"Closing out the weekend with our final meet up and swap meet. Bring things to trade with other owners or simply look around. Who knows? You may just find that wig or accessory that you've been looking for."},"data":{"time":0,"tags":["Fan","Culture"]},"speakers":["AliciaGibson","KeaSnyder","JenniferBeacham"]},"28":{"info":{"title":"History of Pigments and Paint Making","description":"In the past an apprentice's job was the mix the paint for their masters, whose work would one day find itself in our museums, today this process is more accessible than ever and here is your opportunity to learn more about it. We have access to a world of paints and colors that our ancestors could only dream about. Take a moment to learn where these tools of the trade originated and how they have changed over the years."},"data":{"time":0,"tags":["Art"]},"speakers":["DestinyWest"]},"29":{"info":{"title":"Cosplay Chess 2014","description":"Round 4 of the Battle for the Sacred Sakura! Come watch your fellow cosplayers take on a chess battle of epic proportions! Any match-up could happen! \r\n\r\n(Interested participants MUST be over 18 to be on the chessboard!)"},"data":{"time":0,"tags":["Cosplay","Fan"]},"speakers":["AshleyKing"]},"30":{"info":{"title":"Crossplay 101","description":"An introduction to the world of Crossplay by a pair of dedicate Crossplayers. Tips and tricks for make-up, binding, and other solutions to your Crossplay woes and questions will be answered!"},"data":{"time":0,"tags":["Cosplay","Discussion"]},"speakers":["AshleyKing","SherryDennison"]},"31":{"info":{"title":"Hetalia: Ask a Nation","description":"A short panel wherin participants would ask the various nations of the world any question they want!   Plus there'll be short improv sections scattered throughout!"},"data":{"time":0,"tags":["Humor","Fan"]},"speakers":["AiAnimeCosplay"]},"33":{"info":{"title":"Poképower","description":"Pokémon discussion and exchange panel. A talk about Pokémon through the ages, about the games, the changes for better or worse, Ash versus Red, the theories, Pokémon Pokédex exchange and friend codes, plus a shiny give away. Make sure to bring your DS and your Pokémon game."},"data":{"time":0,"tags":["Discussion"]},"speakers":["LauraSikes","CourtneyWatson","MonicaFleming"]},"34":{"info":{"title":"Nerds Who Can Dance","description":"Welcome to Anime Dance Central! This panel is for all of Tokyo In Tulsa's J-Pop fans! Show off your moves, dance with your friends, and make all new friends that know the same dances you do. We'll play anything and dance to anything at your request. From Happy Sythnesizer and PonPonPon, all the dancing way to Caramelldansen and Love and Joy!"},"data":{"time":0,"tags":["Humor","Cosplay","Fan"]},"speakers":["AlexisThedford"]},"35":{"info":{"title":"Code: Lyoko","description":"A panel featuring some of the characters from Code Lyoko! Q&A and general randomness about the show!"},"data":{"time":0,"tags":["Humor","Fan","Discussion"]},"speakers":["RavenMichaelis"]},"37":{"info":{"title":"Welcome to the Country of Hearts!","description":"A panel about heart no kuni Aliceor Alice in the Country of Hearts. Q&A with Ace and all around amazing randomness."},"data":{"time":0,"tags":["Humor","Fan","Discussion"]},"speakers":["RavenMichaelis"]},"38":{"info":{"title":"Let's talk KPOP!","description":"A panel discussing about KPOP! Who's you're favorite group? Who's your bias? What are your thought about so and so!"},"data":{"time":0,"tags":["Fan","Discussion"]},"speakers":["RavenMichaelis"]},"39":{"info":{"title":"Korean Pop Panel 2.0","description":"You experienced our amazing panel last year as being the first of its kind and now here is the more updated and more funner version of it. You will learn about the industry and also about the ever growing genre and also win some really neat prizes. Don't miss out!!"},"data":{"time":0,"tags":["Fan","Discussion","Culture"]},"speakers":["KazumiShibuya"]},"40":{"info":{"title":"Visual Kei: Origins","description":"Explore Visual Kei's roots and learn a little bit about the different genres and where they came from."},"data":{"time":0,"tags":["Fan","Discussion"]},"speakers":["AliciaGibson"]},"41":{"info":{"title":"JRock/JPop Showcase","description":"Stop by and watch music videos from various bands from both JRock and JPop. You never know, you might discover something new!"},"data":{"time":0,"tags":["Fan","Discussion","Culture"]},"speakers":["AliciaGibson"]},"42":{"info":{"title":"Creating a Comic Book Universe","description":"We make comic books so awesome that your pants explode into pizza! From creating characters to marketing your books, we will discuss the process and all the in-betweens."},"data":{"time":0,"tags":["Humor","Discussion","Art","Industry"]},"speakers":["AaronBallinger"]},"43":{"info":{"title":"Nerdy Arts and Crafts","description":"This panel will be all about how to create simple, yet cool nerdy arts and crafts projects! I will explain and demonstrate everything from making Perler bead sprites and clay minature sweets to sewing your own patches ande plushies and creating custom stickers. I will also be talking about helpful blogs and Youtube channels for those wanting to explore each craft further! No experience required!"},"data":{"time":0,"tags":["Cosplay","Art"]},"speakers":["GerranCoppin","N/A","N/A"]},"46":{"info":{"title":"Plus Size Cosplay: Tips, Tricks, and Being Confident in your Body!","description":"Be the best and most confident cosplayer you can be! Learn tips, tricks, and hints to prospering in the world of being a plus size cosplayer."},"data":{"time":0,"tags":["Cosplay","Guest"]},"speakers":["DyanaClaytor"]},"47":{"info":{"title":"TNT Nintendo Street Pass Event","description":"Have a 3DS or 2DS and miss out on all the cool Street Pass stuff? Want to know more about the games that are currently out, or wanting to know more about new releases? Just want to share friend codes so we can play ALL THE GAMES together after the con? Check out this panel! We'll go over questions you have about the system, and probably talk about Pokemon. Like, a lot."},"data":{"time":0,"tags":["Humor","Fan","Discussion","Technology"]},"speakers":["HeatherBall","JayHolman"]},"48":{"info":{"title":"Take One Improv All Ages Show","description":"Have you ever seen whose line is it anyway? Well that's what we do.  We will perform everything from small skits all the way up to 25 minute one-act plays based on your suggestions."},"data":{"time":0,"tags":["Humor","Art","Industry"]},"speakers":["TakeOne"]},"53":{"info":{"title":"Cosplay Photography & Modeling","description":"Whether you’re in front or behind the camera, this is the panel for you!\r\n\r\nI will be discussing techniques on how to make your cosplay photography go from a snapshot to a work of art! For those with camera in hand, I’ll tell you how to make the most of your environments, angles, and lighting to ensure you can capture the best images at every convention. For those wanting to show off their costume creations, you’ll be given beginner modeling tips to offer your best side to the camera every time!"},"data":{"time":0,"tags":["Cosplay","Discussion","Art"]},"speakers":["DemiGray"]},"54":{"info":{"title":"Can You Keep It Up?","description":"​​This panel is not to be taken seriously. In fact, we’re serious about not being serious. This a competition with handpicked contestants who will do their best to remain In-Character while suffering through several challenges that will put all their skills to the test! \r\nPhysical tasks and brain-wracking questionnaires will see if these Supernatural cosplayers can make it or break it! …their character, that is."},"data":{"time":0,"tags":["Humor","Cosplay","Fan"]},"speakers":["DemiGray"]},"55":{"info":{"title":"Heaven or Hell? Let's Rock! - Guilty Gear, BlazBlue, and anything Arc System Works!","description":"Fan of BlazBlue, Guilty Gear, Persona 4 Arena, or any other anime-themed fighting game in general? This is the place for you! Join us for a discussion of our favorite fighters and catch me as we also do presentations of said fighters too!"},"data":{"time":0,"tags":["Humor","Cosplay","Fan","Discussion"]},"speakers":["MikelLaRosa"]},"56":{"info":{"title":"Curtain Call: An Intro to Improv Acting","description":"Improv acting is unique in that the plot, characters, and dialogue are all made up in the moment; the scene will be different every time! We will be discussing the beginning steps to improv acting and give you all the tools needed to build up your acting arsenal. Expect to get physical and get involved, as audience participation is greatly encouraged. For those who want to learn tricks and tips to improve your skits and quick wit, this is the panel for you!"},"data":{"time":0,"tags":["Humor","Discussion"]},"speakers":["DemiGray"]},"57":{"info":{"title":"All About Vocaloid w/ 4amcosplay","description":"4amcosplay presents 'All About Vocaloid'\r\nIn this panel we will be disusing vocaloid and will be having a few short games with prizes."},"data":{"time":0,"tags":["Humor","Cosplay","Fan","Discussion","Guest"]},"speakers":["CarolynDavis"]},"58":{"info":{"title":"4amcosplay Q&A","description":"4amcosplay a local YouTube cosplay group. This panel pretty self explanatory you will get to meet the cosplayer's of 4amcosplay. Ask us random questions like; our cosplays our videos, or our days life etc!"},"data":{"time":0,"tags":["Humor","Cosplay","Fan","Discussion"]},"speakers":["CarolynDavis"]},"59":{"info":{"title":"Character Counts! Techniques For Improving Cosplay","description":"In the world of Cosplay, Character Counts! Using proven techniques, we'll show you how to choose the best character for you, efficiently study and research your character, and apply skills to help better your portrayal! With everything from costuming tips, to creative writing exercises, we're sure to help you take your skits, props, and performances to the next level! BELEIVE IT!"},"data":{"time":0,"tags":["Cosplay","Fan"]},"speakers":["SuzySpecter","MadiBlu"]},"60":{"info":{"title":"From Garbage To Gauntlets: Costuming On A Budget","description":"Ever found yourself wanting a costume or prop, but didn't have the rupees? Let us teach you to make high-quality looking props and costume pieces, while saving your munnys! Using recycled, easily obtained, and household items, we will educate you how to create with low to no budget! Examples of completed items, as well as live demonstrations will be conducted. Bring something to write with, as techniques and suppliers will be discussed at length."},"data":{"time":0,"tags":["Cosplay","Fan","Discussion"]},"speakers":["SuzySpecter","MadiBlu","RachelHipscraps"]},"62":{"info":{"title":"Naruto Discussion Believe It!","description":"Calling all Naruto fans! If you love Naruto, or want to learn about it, you have come to the right place. This open discussion will bring out your inner shinobi! We will have fun talking about anything from the fandom or anything with relation to. We're gonna have fun so stop on by!~"},"data":{"time":0,"tags":["Humor","Fan","Discussion"]},"speakers":["EliseSiler","KelaBlackfox"]},"64":{"info":{"title":"Into the World of Digital Art","description":"Many people have seen the master pieces on Devianart, and many have wonder what goes on behind the scene. In this panel I will tell and show you how to get started in this world.You will learn from creating a work space to a finished sketch on your very own computer screen. From a freelance artist of 2 years to you."},"data":{"time":0,"tags":["Discussion","Technology","Art"]},"speakers":["EliseSiler","KelaBlackfox"]},"65":{"info":{"title":"AMV Creation","description":"AMV's has been a role part in our daily lives for most of us.Some people will even compete with their favorite anime and music. If you want to know how they create their videos,well that is where I come in.I will show you many things,ways,types,and effect you can use. Come on by and stay awhile. We'll have a ball!~"},"data":{"time":0,"tags":["Discussion","Technology"]},"speakers":["EliseSiler","KelaBlackfox"]},"69":{"info":{"title":"Improbable One Piece Theories","description":"What if Sanji at a Zoan fruit for the Flying Spaghetti Monster?\r\nWhat if the One Piece is the one piece of Buggy's body that nobody can find: His real nose\r\nWhat if Usopp is the long lost warrior/prince/prophet of the Ancient Long Nose Tribe and is the hero we need and deserve?\r\n\r\nIn this panel, we'll discuss and even come up with some of the most hilariously improbable One Piece fan theories!"},"data":{"time":0,"tags":["Humor","Fan","Discussion"]},"speakers":["KennedyParker"]},"70":{"info":{"title":"The Horrifyingly Horrifying History of Horror in Anime","description":"Believe it or not, there's more to horror in anime than just Higurashi and Death Note! For example, did you know that the horror genre in anime has really strong roots in the mecha genre, and it's thanks to our giant robot friends that we have anime horror the way it is today? In this panel, we'll discuss the history of horror in anime, how it got to where it is today, and believe me, there are some pretty rad horror anime recommendations in it for you, too. And awesome points. There are lots of awesome points in it for you, too."},"data":{"time":0,"tags":["Fan","Discussion"]},"speakers":["KennedyParker"]},"71":{"info":{"title":"Shingeki...No Questions?","description":"This is a Q & A panel for Attack on Titan! Games will be played, prizes will be won, ships will be sailed, and feels will be felt. This panel will have some minor adult humor, so it's requested that you be 16+!  We will try to have a full cast of characters to answer your questions, however this is not set in stone. Cameras and videotaping will be welcomed, as long as it isn't a major distraction! We encourage you to interact with the characters as much as you'd like, but be careful...ask the wrong thing and you may be titan food...."},"data":{"time":0,"tags":["Humor","Cosplay","Fan","Discussion"]},"speakers":["Alex & JadeSchneiderman & Mangrum","AshleyDial"]},"72":{"info":{"title":"OK GUNPLA Meetup","description":"Oklahoma GUNPLA(Gundam Plastic) meetup!\r\nThis is a meetup for Gundam and GUNPLA fans of all ages and skill levels. Bring on the mecha!"},"data":{"time":0,"tags":["Fan","Culture"]},"speakers":["JayHolman","BretWilson","AaronMorrison"]},"73":{"info":{"title":"Monster Hunter Meetup","description":"Monster Hunter is one of the most popular video game series in Japan. Sadly, it's pretty unheard of elsewhere.\r\nLet's change that! Bring your 3DS, and let's get hunting!"},"data":{"time":0,"tags":["Fan"]},"speakers":["JayHolman","JoeyDougherty","AaronHolman"]},"91":{"info":{"title":"Fangirling 101","description":"Welcome to Fangirling 101! We will go through all of the details of fangirling to the extreme including squealing, cosplay, fanfiction, and of course arm flailing. We will teach you all of what it takes to become a part of a fandom, while treating your sugar tooth with candy!"},"data":{"time":0,"tags":["Humor","Cosplay","Fan","Discussion"]},"speakers":["TamraNicoson","ChevelleRoss"]},"99":{"info":{"title":"Anime Pub Quiz","description":"Think you know all there is to know about anime? Enjoy playing trivia and making new friends? Looking for something to do after 9 that doesn't leave you feeling like Pedo-Bear's long lost, far creepier, twin? Then Anime Pub Quiz is for you. It's bar trivia with your favorite Japanese media twist. And no, we can't promise there won't be tentacles."},"data":{"time":0,"tags":["Humor","Fan"]},"speakers":["CaseyMcGill","JenniferBrown"]},"102":{"info":{"title":"Astronomy in Japan","description":"Until relatively recently, Japan has been an isolationist nation. Only in the past few centuries has it opened its borders, allowing a surge of new information and ideas. Since then, Japan has reformed itself considerably, becoming a technological and scientific superpower.\r\n\r\nOne of the areas to which Japanese nationals have contributed greatly, is the field of astronomy. This lecture explores their contributions, from stellar formation to the Big Bang."},"data":{"time":0,"tags":["Culture"]},"speakers":["JonVoisey"]},"104":{"info":{"title":"Exorcist Discussion","description":"I'm not ...a human or a demon. But I WILL be...AN EXORCIST!! Now can you tell me who said this? Rin Okumura? If that's your guess than your right! Now your on your way to become a true Exorcist! \r\nCome fight Hellfire with Hellfire with us in our discussion of Blue Exorcist!"},"data":{"time":0,"tags":["Humor","Fan","Discussion"]},"speakers":["EliseSiler","KelaBlackfox","JadenAustin"]},"105":{"info":{"title":"How Not to Draw Manga","description":"Oh, the classic \"How to Draw Manga\" books we've all seen on the shelves of our elementary school book fairs. They're not all helpful, in fact, most of them are quite the opposite. In this panel, we're going to be looking and laughing at some of the least helpful how-to-draw manga books. Not only will this panel make you feel MUCH better about your artistic skills, but there will also be a few helpful tips to improve them, too! (Don't worry, none of them are from the how-to-draw books)"},"data":{"time":0,"tags":["Humor","Art"]},"speakers":["KennedyParker"]},"106":{"info":{"title":"Bento Basics","description":"Japanese bento (box) lunches are known for their nutritious composition and aesthetic appeal. Here, we’ll look at the elements of making a bento, including several suitable authentic recipes, and how they can be used to create a bento lunch."},"data":{"time":0,"tags":["Culture"]},"speakers":["JonVoisey"]}},"speakers":{"CarolynDavis":{"first":"Carolyn","last":"Davis","description":"Name: Carolyn Davis\r\nAge: 16\r\n~ is the manager of 4amcosplay","title":"Carolyn Davis","panels":["58","57"]},"EliseSiler":{"first":"Elise","last":"Siler","description":"I started to create AMV back in 2010, and have greatly improved.Last year at Izumi-con I enter 5 entries. Sadly you can't beat 'I'm to Sexy.' I use Free for most of my works, so be warned.","title":"Elise Siler","panels":["65","104","64","62"]},"KelaBlackfox":{"first":"Kela","last":"Blackfox","description":"I will be helping Elise wit hall her panels. top on bye for all of them!~","title":"Kela Blackfox","panels":["65","104","14","64","62"]},"CaseyMcGill":{"first":"Casey","last":"McGill","description":"Just an anime fan who enjoys cosplay, IPAs, trivia, and the rich smell of mahogany.","title":"Casey McGill","panels":["99"]},"JenniferBrown":{"first":"Jennifer","last":"Brown","description":"Anime fan by day. Professional profanity artist by night.","title":"Jennifer Brown","panels":["99"]},"JonVoisey":{"first":"Jon","last":"Voisey","description":"Jon graduated with a degree in Astronomy from the University of Kansas in 2008. During his time there, Kansas was involved in its \"great evolution wars\". Shortly after Jon began at KU, the Kansas State Board of Education, in effort to push pseudoscience into science classrooms, redefined science, removing the requirement that explanations be testable. Attempting to understand and correct such public misunderstanding of science, Jon moved towards a focus on science outreach and education, touring talks at conventions across the country.\r\n\r\nHe was previously a contributor to the astronomy news website Universe Today. His writings there have been picked up by numerous other science news outlets including physorg and Astrobiology Magazine. He is certified to teach high school and middle school math and science but currently works in estate jewelry and antiques.","title":"Jon Voisey","panels":["102","106"]},"AliciaGibson":{"first":"Alicia","last":"Gibson","description":"Alicia has been active in the doll community since 2005, joining her are Kea Synder and Jennifer Beacham. All three of these young ladies have extensive knowledge of the hobby and a diverse collection of Dollfie between them.","title":"Alicia Gibson","panels":["25","23","26","24","41","40"]},"KeaSnyder":{"first":"Kea","last":"Snyder","description":"","title":"Kea Snyder","panels":["25","23","26"]},"JenniferBeacham":{"first":"Jennifer","last":"Beacham","description":"","title":"Jennifer Beacham","panels":["25","23","26","24"]},"DemiGray":{"first":"Demi","last":"Gray","description":"Having worked as a professional actress since 2008, Demi has had several years of improv acting, stage acting, and acting a fool beneath her belt. She's been cosplaying for even longer, and takes pride when recreating her favorite characters in image and presentation. To keep up with her work, check out her site!","title":"Demi Gray","panels":["54","53","56"]},"SuzySpecter":{"first":"Suzy","last":"Specter","description":"Specter is an multi-talented performer who has been showcasing her art and creations for over 20 years.. From dancing to fashion and everything in between, she places her own unique touch on the world, leaning heavily towards \"the darker side of things\". Known as a gaming enthusiast, her talents extend beyond the world of performance art into the vast universe of video games, movies, comics, cosplay and much more! Specter is also the host of her own youtube show, \"Specter Vision\" that takes you behind the scenes with bands, indie film makers, makeup artists and all kinds of people who inspire Specter's world!","title":"Suzy Specter","panels":["59","60"]},"MadiBlu":{"first":"Madi","last":"Blu","description":"A Tulsa native and cosplay enthusiast, Madi aka \"Blu\" has a love for all things Anime! With years of experience in the costuming world, she has extensive knowledge and expertise in wig craft, make up, and design. Both a dancer and a seamstress, she has made many creations come to life. Blu has studied Japanese and Fashion/Apparel Design at TCC/OSU","title":"Madi Blu","panels":["59","60"]},"RavenMichaelis":{"first":"Raven","last":"Michaelis","description":"A 5 year con goer who has a passion for gaming, anime, and cosplay just like everyone else!!","title":"Raven Michaelis","panels":["35","18","38","17","37"]},"AshleyKing":{"first":"Ashley","last":"King","description":"Ashley has been your Cosplay Chess host for the past three years. Each year she works to ensure that participants have the best experience possible while keeping it safe, sane, and fun.","title":"Ashley King","panels":["29","30"]},"SpencerParks":{"first":"Spencer","last":"Parks","description":"My name is Spencer and I've been going to conventions for a few years now. I've enjoyed every second of my convention experience, and I'm looking forward to help making Tokyo in Tulsa as great as it can be in my own little way. I love cosplaying, and it's one of my favorite, if expensive, pastimes.","title":"Spencer Parks","panels":["20"]},"AaronBallinger":{"first":"Aaron","last":"Ballinger","description":"Aaron is the CEO and co-founder of Equinox Comics.  An Oklahoma native who is determined to showcase the state's most talented creators.","title":"Aaron Ballinger","panels":["42"]},"SherryDennison":{"first":"Sherry","last":"Dennison","description":"","title":"Sherry Dennison","panels":["30"]},"TiffanyShafer":{"first":"Tiffany","last":"Shafer","description":"Tiffany Shafer, also known as Scarlet Heart Cosplay, has been cosplaying for five years. An amateur armor builder and prop fabricator, lately she has been working on creating the various outfits of her favorite character Erza Scarlet of Fairy Tail.","title":"Tiffany Shafer","panels":["15"]},"TerriMcGuire":{"first":"Terri","last":"McGuire","description":"Also known as Teriyaki Tako, she loves to spend her time playing Final Fantasy 13 and working on different cosplays. Currently she is working on making the different versions of Juvia Lockser from Fairy Tail.","title":"Terri McGuire","panels":["15"]},"KeaSynder":{"first":"Kea","last":"Synder","description":"","title":"Kea Synder","panels":["24"]},"JadenAustin":{"first":"Jaden","last":"Austin","description":"I'm a small town girl who simply loves anime, mostly Blue Exorcist. My best friend Elise ( Kat) introduced me to this and I'm glade.","title":"Jaden Austin","panels":["104"]},"TamraNicoson":{"first":"Tamra","last":"Nicoson","description":"This panel will be hosted by Tamra (Codiee) Nicoson and Chevelle Ross. We have been best friends as fellow cosplayers for about a year.","title":"Tamra Nicoson","panels":["91"]},"ChevelleRoss":{"first":"Chevelle","last":"Ross","description":"Chevelle Ross has been a cosplayer and a part of the Anime fandom for about a year now.","title":"Chevelle Ross","panels":["91"]},"RachelHipscraps":{"first":"Rachel","last":"Hipscraps","description":"Originally a Dallas darling, Rachel \"Hipscraps\" is a talented writer, costume designer, and photographer. Specializing in creating hand-sewn works of art for belly dancers, her attention to detail has made her name synonymous with quality and beauty. Every 'Hipscrap' is one of a kind! A fashion aficionado, she graduated from Washington High School For The Performing And Visual Arts, (B.T.W.H.S.P.V.A.) and currently operates a successful network of dancers and performers Transcendance Tulsa.","title":"Rachel Hipscraps","panels":["60"]},"AudiePritchett":{"first":"Audie","last":"Pritchett","description":"A normal guy who has been sucked into the world of anime.","title":"Audie Pritchett","panels":["12"]},"BryceNelson":{"first":"Bryce","last":"Nelson","description":"An up and coming manga and anime fan.","title":"Bryce Nelson","panels":["12"]},"MikelLaRosa":{"first":"Mikel","last":"LaRosa","description":"Mikel is a fighting game player and one of the many frequent members of the Fighting Game Community, based in Tulsa, Oklahoma. His experience with fighting games dates back to the first time he played Tekken 3 on his PS1. He is also a moderator for the Dustloop forums, where he is the head moderator for all things in relation to BlazBlue: Chronophantasma character Kagura Mutsuki!","title":"Mikel LaRosa","panels":["55"]},"AiAnimeCosplay":{"first":"AiAnime","last":"Cosplay","description":"AiAnime Cosplay is a cosplay group based in Tulsa, Oklahoma.  We primarily produce short Hetalia and Kingdom Hearts CMV's and Sketches for YouTube.","title":"AiAnime Cosplay","panels":["31"]},"DestinyWest":{"first":"Destiny","last":"West","description":"Hello! I'm Destiny West, a college student pursuing my Bachelor's of Art and my teaching certification at USAO. I've had the privilege of working with many art mediums while in pursuit of my degree and I love opportunities to share what I've learned. I'm a jack of all trades and practice in oil painting, watercolor, inks, screenprinting, ceramics, and glassblowing.","title":"Destiny West","panels":["28"]},"CosplayEverything":{"first":"Cosplay","last":"Everything","description":"we are a cosplay group out of Oklahoma City and really do Cosplay Everything hence the name.  We can't wait to present our first panel and join in the convention fun!","title":"Cosplay Everything","panels":["13"]},"BizYoung":{"first":"Biz","last":"Young","description":"","title":"Biz Young","panels":["13"]},"Mira(AiAnimeCosplay)":{"first":"Mira","last":"(AiAnimeCosplay)","description":"","title":"Mira (AiAnimeCosplay)","panels":["13"]},"KennedyParker":{"first":"Kennedy","last":"Parker","description":"Kennedy Parker: Artist, horror movie enthusiast, peanut butter expert, the best dinosaur trainer in the galaxy, aspiring Lord of the Things, honorary Power Ranger, has an existence sustained on the power of pure rock n' roll energy, and a longtime watcher of anime. One Piece and Shiki are her favorites. She's done panels at A-kon, Anime Boston, and she's proud of this being her second time doing panels at Tokyo in Tulsa!","title":"Kennedy Parker","panels":["105","69","70"]},"KrystalLong":{"first":"Krystal","last":"Long","description":"Hello, My name is Krystal and I am 20 years old and college student at Tulsa Community College! I am one of Hostesses for JFashion 101 Panel! I also cosplay, I am founder of a dance group, and Otaku! I have been studying Japanese Fashion since I was 13 years old (8 years) though I am not in one of the styles is because I put together outfits with each element of the trends I like. I will be debuting one of my outfits that I will be making at the panel, so I hope to see there! You get to see pictures of some of my Jfashion stuff I own :)! If you want to get hold of me before hand for some question my email is midnighttime14@gmail.com.","title":"Krystal Long","panels":["22"]},"GerranCoppin":{"first":"Gerran","last":"Coppin","description":"Graduate of Northeastern State University and librarian at the Muskogee Public Library. Founder and former president of the Northeastern State Anime Club. JRPG, Jmusic, and sewing otaku! \r\nLinks:\r\nhttp://ganbattesewing.tumblr.com\r\nhttp://excitablelibrarian.tumblr.com/\r\nwww.youtube.com/user/YokaiAkito\r\nyokaiakito@gmail.com","title":"Gerran Coppin","panels":["22","43"]},"KazumiShibuya":{"first":"Kazumi","last":"Shibuya","description":"A fangirl of K-pop and also a teacher of the genre.","title":"Kazumi Shibuya","panels":["39"]},"JayHolman":{"first":"Jay","last":"Holman","description":"Just another Monster Hunter fanboy hoping to get fans together.","title":"Jay Holman","panels":["73","72","47"]},"JoeyDougherty":{"first":"Joey","last":"Dougherty","description":"And another MH fanboy!","title":"Joey Dougherty","panels":["73"]},"AaronHolman":{"first":"Aaron","last":"Holman","description":"AND ANOTHER!","title":"Aaron Holman","panels":["73"]},"AlexisThedford":{"first":"Alexis","last":"Thedford","description":"My name is Alexis Thedford and this will be my third time coming to TnT. I enjoy drawing, dancing, singing, and of course anime!","title":"Alexis Thedford","panels":["34"]},"N/A":{"first":"N/A","last":"","description":"","title":"N/A ","panels":["43","43"]},"BretWilson":{"first":"Bret","last":"Wilson","description":"A member and admin of OK GUNPLA, Bret is a prime example of mete-enthusiest!","title":"Bret Wilson","panels":["72"]},"AaronMorrison":{"first":"Aaron","last":"Morrison","description":"OK GUNPLA admin Aaron is a hard-core Gundam fan.","title":"Aaron Morrison","panels":["72"]},"DyanaClaytor":{"first":"Dyana","last":"Claytor","description":"Dyana is the owner and founder of Plus!SizeCosplay on Facebook, they have been cosplaying since 2008 and have been featured on many websites such as: Southern Cospitality, Plus Sized Cosplayers in the USA, Global Cosplay Association, Cosplay in America and more!","title":"Dyana Claytor","panels":["46"]},"LauraSikes":{"first":"Laura","last":"Sikes","description":"Laura is a Pokémaniac and Gym Leader for Rose State College, Fairy type. She is 21 years old and is an artist. She has been going to conventions since 2011.","title":"Laura Sikes","panels":["33"]},"CourtneyWatson":{"first":"Courtney","last":"Watson","description":"Courtney is 20 years old and goes to Rose State College. She is hyper, squeaky (like a guinea pig), and a fanfiction writer. She has been going to conventions since 2012.","title":"Courtney Watson","panels":["33"]},"MonicaFleming":{"first":"Monica","last":"Fleming","description":"Monica is 20 years old and goes to Rose State College. She is funny, outgoing, and loud when need be. She has been going to conventions since 2013.","title":"Monica Fleming","panels":["33"]},"LinzyTakahashi":{"first":"Linzy","last":"Takahashi","description":"I'm fun loving and outgoing.","title":"Linzy Takahashi","panels":["7","8","4"]},"MinaHendo":{"first":"Mina","last":"Hendo","description":"She's fun loving and a bit of a book worm.","title":"Mina Hendo","panels":["7","8","4"]},"KeraOtaku":{"first":"Kera","last":"Otaku","description":"She's fun loving and outgoing.","title":"Kera Otaku","panels":["7","8","4"]},"Alex & JadeSchneiderman & Mangrum":{"first":"Alex & Jade","last":"Schneiderman & Mangrum","description":"Alex and Jade are the co-creators of the cosplay group, CosplayWithACape. They've been cosplaying for three-five years. They've both seen this anime and read the manga, so they know what's what for Attack on Titan. They both have experience in panels, such as this one. They are both have acting experience, so making this panel believable should not be difficult!","title":"Alex & Jade Schneiderman & Mangrum","panels":["71"]},"AshleyDial":{"first":"Ashley","last":"Dial","description":"Ashley is our Mikasa, best friend to Alex & Jade. She has performed with the two other presenters, and has attended and performed in panels with Alex & Jade. She is a cosplayer as well, and a small background with improv acting.","title":"Ashley Dial","panels":["71"]},"TakeOne":{"first":"Take","last":"One","description":"Take One Productions  is an improv comedy group started in 2007, by the troupe’s Founder & Director, Cory Phillips. Since those early days, we have grown in size and popularity. We have been blessed with an awesome staff and even more amazing fans. In recent years, we have expanded from tiny local venues to massive nationwide performances. From Hawaii, to your local coffee shop, and all over in between, our shows are always a smashing success.\r\n\r\nEach member of Take One Productions has been genetically engineered to bring the maximum amount of entertainment to our stage. Our actors use their epic super powers to keep our audience ROFLOL (rolling on the floor laughing out loud.) You don’t want to miss an opportunity to see the amazing comedic talent put forth by TAKE ONE PRODUCTIONS. Whether you just want to watch improv happen or you’re interested in learning from the masters themselves, joining us for our shows and workshops is a must!”","title":"Take One","panels":["48"]},"HeatherBall":{"first":"Heather","last":"Ball","description":"As a total nerd for handhelds, I've had a Nintendo system on me since I was 8. I've had a 3DS since they've been out, and I've upgraded to 3DS XL since they've come out as well. I dabble in various games for the 3DS, but I mostly play the Street Pass games. I games such as Animal Crossing, Zelda: Link Between Worlds, and Pushmo.","title":"Heather Ball","panels":["47"]}}}