{"panels":{"4":{"info":{"title":"Welcome to Silent Hill","description":"Prepare to enter a world where all your worst fears become reality. I just have one question for you. Do you have what it takes to survive?","location":"Panel Room C","time":"06:00 pm"},"data":{"time":1405123200000,"tags":["Fan","Discussion"],"day":"Friday"},"speakers":["LinzyTakahashi","MinaHendo","KeraOtaku"]},"7":{"info":{"title":"Sailor Moon Mania","description":"This is a panel dedicated to everyones favorite soldier of justice, Sailor Moon.","location":"Panel Room D","time":"09:00 pm"},"data":{"time":1405134000000,"tags":["Humor","Fan","Discussion"],"day":"Friday"},"speakers":["LinzyTakahashi","MinaHendo","KeraOtaku"]},"8":{"info":{"title":"Welcome to Phantomhive Manor","description":"This panel is all about the anime Black Butler. Trust me, you're not gonna want to miss this.","location":"Panel Room C","time":"02:00 pm"},"data":{"time":1405108800000,"tags":["Humor","Fan","Discussion"],"day":"Friday"},"speakers":["LinzyTakahashi","MinaHendo","KeraOtaku"]},"12":{"info":{"title":"Fullmetal Alchemist fan panel","description":"Where fans of FMA can come together.","location":"TBA","time":""},"data":{"time":0,"tags":["Humor","Fan","Discussion"],"day":""},"speakers":["AudiePritchett","BryceNelson"]},"13":{"info":{"title":"Homestuck Dating Panel","description":"Ever wanted to date a troll? well now you can as Nepeta herself leads a wonderful date panel and assists you in your love life! Audience members will be participating if you would like. its that simple write questions for our hat for Nep to ask our dates and participate in the dating part if chosen! XD So come try to ship yourself with your favorite troll and remember we ship it like fedex!","location":"Panel Room D","time":"02:00 pm"},"data":{"time":1405108800000,"tags":["Humor","Cosplay","Fan"],"day":"Friday"},"speakers":["CosplayEverything","BizYoung","Mira(AiAnimeCosplay)"]},"14":{"info":{"title":"Homestuck Truth or Dare","description":"It will just be with a Homestuck truth or dare panel, nothing so serious. It will be PG-13 so kids can come and have fun to.","location":"Panel Room E","time":"10:00 pm"},"data":{"time":1405137600000,"tags":["Humor"],"day":"Friday"},"speakers":["KelaBlackfox"]},"15":{"info":{"title":"Do Fairies Have Tails","description":"So, you think you've got what it takes to join the most powerful guild in Fiore? Or maybe you've just got some questions you need answered from the most powerful team of Fairy Tail. Join Erza Scarlet, Natsu Dragneel, Lucy Heartfilia, and Juvia Lockser, as we discuss the power and might of Fairy Tail.","location":"Panel Room D","time":"12:30 pm"},"data":{"time":1405189800000,"tags":["Humor","Fan"],"day":"Saturday"},"speakers":["TiffanyShafer","TerriMcGuire"]},"17":{"info":{"title":"Let's Go Xiaolin Showdown!","description":"Random talk about Xiaolin Showdown and Q & A with Jack Spicer","location":"Panel Room D","time":"11:00 am"},"data":{"time":1405270800000,"tags":["Humor","Discussion"],"day":"Sunday"},"speakers":["RavenMichaelis"]},"18":{"info":{"title":"Let's Talk Final Fantasy","description":"A fan panel to discuss all things final fantasy hosted by Lightning Farron!","location":"Panel Room D","time":"12:00 pm"},"data":{"time":1405274400000,"tags":["Fan","Discussion"],"day":"Sunday"},"speakers":["RavenMichaelis"]},"20":{"info":{"title":"Cosplay Wigs 101","description":"New to cosplay or just curious about wigs? Bring your notepad! This panel is the place for you! We'll be going over basic wig cutting techniques, as well as where to find the perfect wig and what supplies you'll be needing. Cosplay greenhorns welcome!","location":"Panel Room E","time":"02:30 pm"},"data":{"time":1405283400000,"tags":["Cosplay"],"day":"Sunday"},"speakers":["SpencerParks"]},"22":{"info":{"title":"Japanese Fashion 101","description":"Street Style Fashionsta and Lolita coming together to show and teach you about the different Japanese Fashion trends in Japan! We discuss from the beginning of the Fashion storm in Japan to the present, Online Websites, and  to where some of the styles pop up at. We are also going to do drawing from a basket of goodies we have made ourselves to little accessories we have bought from our favorite online shops! We will also answer any question to how to start going into fashion style you like the most! We hope to see you there!","location":"Panel Room D","time":"02:00 pm"},"data":{"time":1405281600000,"tags":["Fan","Discussion","Culture"],"day":"Sunday"},"speakers":["KrystalLong","GerranCoppin"]},"23":{"info":{"title":"Dollfie 101 and Meet Up","description":"Get to know your local dollfie enthusiasts, mingle with other doll owners and get some basic information dollfie. It is a joint project between the Central Oklahoma Ball Jointed Divas and DOT - The Dollfie Organization of Tulsa and we will be on site all weekend for more fun and prizes, so come and see us!","location":"Panel Room E","time":"03:00 pm"},"data":{"time":1405112400000,"tags":["Fan","Culture"],"day":"Friday"},"speakers":["AliciaGibson","KeaSnyder","JenniferBeacham"]},"24":{"info":{"title":"Dollfie FIrst Aid","description":"Do you have questions on maintaining your doll? Are they too floppy? Too tight? Don't hold a pose well? This panel will answer all of your questions about maintaining your doll and will have hands on assistance and demonstrations on the different aspects of caring for your dollfie. We will be available to assist with stringing and sueding, however it will be first come, first serve and we ask that you only bring us one problem doll per person so that we will have a chance to assist others as time allows.","location":"Panel Room E","time":"10:00 am"},"data":{"time":1405180800000,"tags":["Fan","Culture"],"day":"Saturday"},"speakers":["AliciaGibson","KeaSynder","JenniferBeacham"]},"25":{"info":{"title":"BJD Slumber Party","description":"Bring your dolls decked out in their best sleeping attire and mingle with other owners until the wee hours of the morning. Well, not really. Just until the Convention Center kicks us out.","location":"Panel Room E","time":"11:00 pm"},"data":{"time":1405227600000,"tags":["Fan","Culture"],"day":"Saturday"},"speakers":["AliciaGibson","KeaSnyder","JenniferBeacham"]},"26":{"info":{"title":"Dollfie Meet 'n' Swap","description":"Closing out the weekend with our final meet up and swap meet. Bring things to trade with other owners or simply look around. Who knows? You may just find that wig or accessory that you've been looking for.","location":"Panel Room E","time":"12:00 pm"},"data":{"time":1405274400000,"tags":["Fan","Culture"],"day":"Sunday"},"speakers":["AliciaGibson","KeaSnyder","JenniferBeacham"]},"28":{"info":{"title":"History of Pigments and Paint Making","description":"In the past an apprentice's job was the mix the paint for their masters, whose work would one day find itself in our museums, today this process is more accessible than ever and here is your opportunity to learn more about it. We have access to a world of paints and colors that our ancestors could only dream about. Take a moment to learn where these tools of the trade originated and how they have changed over the years.","location":"Panel Room C","time":"10:00 am"},"data":{"time":1405180800000,"tags":["Art"],"day":"Saturday"},"speakers":["DestinyWest"]},"29":{"info":{"title":"Cosplay Chess 2014","description":"Round 4 of the Battle for the Sacred Sakura! Come watch your fellow cosplayers take on a chess battle of epic proportions! Any match-up could happen! \r\n\r\n(Interested participants MUST be over 18 to be on the chessboard!)","location":"Demo Area","time":"03:00 pm"},"data":{"time":1405198800000,"tags":["Cosplay","Fan"],"day":"Saturday"},"speakers":["AshleyKing"]},"30":{"info":{"title":"Crossplay 101","description":"An introduction to the world of Crossplay by a pair of dedicate Crossplayers. Tips and tricks for make-up, binding, and other solutions to your Crossplay woes and questions will be answered!","location":"Panel Room C","time":"07:30 pm"},"data":{"time":1405128600000,"tags":["Cosplay","Discussion"],"day":"Friday"},"speakers":["AshleyKing","SherryDennison"]},"31":{"info":{"title":"Hetalia: Ask a Nation","description":"A short panel wherin participants would ask the various nations of the world any question they want!   Plus there'll be short improv sections scattered throughout!","location":"Panel Room C","time":"09:00 pm"},"data":{"time":1405220400000,"tags":["Humor","Fan"],"day":"Saturday"},"speakers":["AiAnimeCosplay"]},"33":{"info":{"title":"Poképower","description":"Pokémon discussion and exchange panel. A talk about Pokémon through the ages, about the games, the changes for better or worse, Ash versus Red, the theories, Pokémon Pokédex exchange and friend codes, plus a shiny give away. Make sure to bring your DS and your Pokémon game.","location":"Panel Room C","time":"01:30 pm"},"data":{"time":1405193400000,"tags":["Discussion"],"day":"Saturday"},"speakers":["LauraSikes","CourtneyWatson","MonicaFleming"]},"34":{"info":{"title":"Nerds Who Can Dance","description":"Welcome to Anime Dance Central! This panel is for all of Tokyo In Tulsa's J-Pop fans! Show off your moves, dance with your friends, and make all new friends that know the same dances you do. We'll play anything and dance to anything at your request. From Happy Sythnesizer and PonPonPon, all the dancing way to Caramelldansen and Love and Joy!","location":"Demo Area","time":"01:30 pm"},"data":{"time":1405193400000,"tags":["Humor","Cosplay","Fan"],"day":"Saturday"},"speakers":["AlexisThedford"]},"35":{"info":{"title":"Code: Lyoko","description":"A panel featuring some of the characters from Code Lyoko! Q&A and general randomness about the show!","location":"Panel Room D","time":"10:00 pm"},"data":{"time":1405137600000,"tags":["Humor","Fan","Discussion"],"day":"Friday"},"speakers":["RavenMichaelis"]},"37":{"info":{"title":"Welcome to the Country of Hearts!","description":"A panel about heart no kuni Aliceor Alice in the Country of Hearts. Q&A with Ace and all around amazing randomness.","location":"Panel Room C","time":"08:30 pm"},"data":{"time":1405132200000,"tags":["Humor","Fan","Discussion"],"day":"Friday"},"speakers":["RavenMichaelis"]},"38":{"info":{"title":"Let's talk KPOP!","description":"A panel discussing about KPOP! Who's you're favorite group? Who's your bias? What are your thought about so and so!","location":"Panel Room D","time":"04:30 pm"},"data":{"time":1405117800000,"tags":["Fan","Discussion"],"day":"Friday"},"speakers":["RavenMichaelis"]},"39":{"info":{"title":"Korean Pop Panel 2.0","description":"You experienced our amazing panel last year as being the first of its kind and now here is the more updated and more funner version of it. You will learn about the industry and also about the ever growing genre and also win some really neat prizes. Don't miss out!!","location":"Panel Room E","time":"02:00 pm"},"data":{"time":1405108800000,"tags":["Fan","Discussion","Culture"],"day":"Friday"},"speakers":["KazumiShibuya"]},"40":{"info":{"title":"Visual Kei: Origins","description":"Explore Visual Kei's roots and learn a little bit about the different genres and where they came from.","location":"Panel Room C","time":"04:30 pm"},"data":{"time":1405204200000,"tags":["Fan","Discussion"],"day":"Saturday"},"speakers":["AliciaGibson"]},"41":{"info":{"title":"JRock/JPop Showcase","description":"Stop by and watch music videos from various bands from both JRock and JPop. You never know, you might discover something new!","location":"Panel Room C","time":"12:30 pm"},"data":{"time":1405276200000,"tags":["Fan","Discussion","Culture"],"day":"Sunday"},"speakers":["AliciaGibson"]},"42":{"info":{"title":"Creating a Comic Book Universe","description":"We make comic books so awesome that your pants explode into pizza! From creating characters to marketing your books, we will discuss the process and all the in-betweens.","location":"Panel Room C","time":"04:00 pm"},"data":{"time":1405288800000,"tags":["Humor","Discussion","Art","Industry"],"day":"Sunday"},"speakers":["AaronBallinger"]},"43":{"info":{"title":"Nerdy Arts and Crafts","description":"This panel will be all about how to create simple, yet cool nerdy arts and crafts projects! I will explain and demonstrate everything from making Perler bead sprites and clay minature sweets to sewing your own patches ande plushies and creating custom stickers. I will also be talking about helpful blogs and Youtube channels for those wanting to explore each craft further! No experience required!","location":"Panel Room D","time":"04:00 pm"},"data":{"time":1405288800000,"tags":["Cosplay","Art"],"day":"Sunday"},"speakers":["GerranCoppin","N/A","N/A"]},"44":{"info":{"title":"Japanese Music Video Fest","description":"I will be featuring a nonstop playlist of Japanese music video ranging from pop, rap, rock, dance, and beyond! Classic, indie, and up-and-coming performers and bands will all be given equal time and attention! So, please join us as we kick back and watch some great music videos!","location":"Panel Room E","time":"04:00 pm"},"data":{"time":1405202400000,"tags":["Fan","Culture","Art"],"day":"Saturday"},"speakers":["GerranCoppin"]},"46":{"info":{"title":"Plus Size Cosplay: Tips, Tricks, and Being Confident in your Body!","description":"Be the best and most confident cosplayer you can be! Learn tips, tricks, and hints to prospering in the world of being a plus size cosplayer.","location":"Panel Room E","time":"02:00 pm"},"data":{"time":1405195200000,"tags":["Cosplay","Guest"],"day":"Saturday"},"speakers":["DyanaClaytor"]},"47":{"info":{"title":"TNT Nintendo Street Pass Event","description":"Have a 3DS or 2DS and miss out on all the cool Street Pass stuff? Want to know more about the games that are currently out, or wanting to know more about new releases? Just want to share friend codes so we can play ALL THE GAMES together after the con? Check out this panel! We'll go over questions you have about the system, and probably talk about Pokemon. Like, a lot.","location":"Panel Room D","time":"11:30 am"},"data":{"time":1405186200000,"tags":["Humor","Fan","Discussion","Technology"],"day":"Saturday"},"speakers":["HeatherBall","JayHolman"]},"48":{"info":{"title":"Take One Improv All Ages Show","description":"Have you ever seen whose line is it anyway? Well that's what we do.  We will perform everything from small skits all the way up to 25 minute one-act plays based on your suggestions.","location":"Panel Room B","time":"08:00 pm"},"data":{"time":1405216800000,"tags":["Humor","Art","Industry"],"day":"Saturday"},"speakers":["TakeOne"]},"53":{"info":{"title":"Cosplay Photography & Modeling","description":"Whether you’re in front or behind the camera, this is the panel for you!\r\n\r\nI will be discussing techniques on how to make your cosplay photography go from a snapshot to a work of art! For those with camera in hand, I’ll tell you how to make the most of your environments, angles, and lighting to ensure you can capture the best images at every convention. For those wanting to show off their costume creations, you’ll be given beginner modeling tips to offer your best side to the camera every time!","location":"Panel Room C","time":"03:30 pm"},"data":{"time":1405114200000,"tags":["Cosplay","Discussion","Art"],"day":"Friday"},"speakers":["DemiGray"]},"54":{"info":{"title":"Can You Keep It Up?","description":"This panel is not to be taken seriously. In fact, we’re serious about not being serious. This a competition with handpicked contestants who will do their best to remain In-Character while suffering through several challenges that will put all their skills to the test! Physical tasks and brain-wracking questionnaires will see if these cosplayers can make it or break it! …their character, that is.","location":"Panel Room D","time":"09:30 pm"},"data":{"time":1405222200000,"tags":["Humor","Cosplay","Fan"],"day":"Saturday"},"speakers":["DemiGray"]},"55":{"info":{"title":"Heaven or Hell? Let's Rock! - Guilty Gear, BlazBlue, and anything Arc System Works!","description":"Fan of BlazBlue, Guilty Gear, Persona 4 Arena, or any other anime-themed fighting game in general? This is the place for you! Join us for a discussion of our favorite fighters and catch me as we also do presentations of said fighters too!","location":"Panel Room E","time":"03:30 pm"},"data":{"time":1405287000000,"tags":["Humor","Cosplay","Fan","Discussion"],"day":"Sunday"},"speakers":["MikelLaRosa"]},"56":{"info":{"title":"Curtain Call: An Intro to Improv Acting","description":"Improv acting is unique in that the plot, characters, and dialogue are all made up in the moment; the scene will be different every time! We will be discussing the beginning steps to improv acting and give you all the tools needed to build up your acting arsenal. Expect to get physical and get involved, as audience participation is greatly encouraged. For those who want to learn tricks and tips to improve your skits and quick wit, this is the panel for you!","location":"Panel Room C","time":"08:00 pm"},"data":{"time":1405216800000,"tags":["Humor","Discussion"],"day":"Saturday"},"speakers":["DemiGray"]},"57":{"info":{"title":"All About Vocaloid w/ 4amcosplay","description":"4amcosplay presents 'All About Vocaloid'\r\nIn this panel we will be disusing vocaloid and will be having a few short games with prizes.","location":"Panel Room E","time":"06:00 pm"},"data":{"time":1405123200000,"tags":["Humor","Cosplay","Fan","Discussion","Guest"],"day":"Friday"},"speakers":["CarolynDavis"]},"58":{"info":{"title":"4amcosplay Q&A","description":"4amcosplay a local YouTube cosplay group. This panel pretty self explanatory you will get to meet the cosplayer's of 4amcosplay. Ask us random questions like; our cosplays our videos, or our days life etc!","location":"Panel Room D","time":"10:30 pm"},"data":{"time":1405225800000,"tags":["Humor","Cosplay","Fan","Discussion"],"day":"Saturday"},"speakers":["CarolynDavis"]},"59":{"info":{"title":"Character Counts! Techniques For Improving Cosplay","description":"In the world of Cosplay, Character Counts! Using proven techniques, we'll show you how to choose the best character for you, efficiently study and research your character, and apply skills to help better your portrayal! With everything from costuming tips, to creative writing exercises, we're sure to help you take your skits, props, and performances to the next level! BELEIVE IT!","location":"Panel Room D","time":"03:30 pm"},"data":{"time":1405114200000,"tags":["Cosplay","Fan"],"day":"Friday"},"speakers":["SuzySpecter","MadiBlu"]},"60":{"info":{"title":"From Garbage To Gauntlets: Costuming On A Budget","description":"Ever found yourself wanting a costume or prop, but didn't have the rupees? Let us teach you to make high-quality looking props and costume pieces, while saving your munnys! Using recycled, easily obtained, and household items, we will educate you how to create with low to no budget! Examples of completed items, as well as live demonstrations will be conducted. Bring something to write with, as techniques and suppliers will be discussed at length.","location":"Panel Room D","time":"06:00 pm"},"data":{"time":1405123200000,"tags":["Cosplay","Fan","Discussion"],"day":"Friday"},"speakers":["SuzySpecter","MadiBlu","RachelHipscraps"]},"62":{"info":{"title":"Naruto Discussion Believe It!","description":"Calling all Naruto fans! If you love Naruto, or want to learn about it, you have come to the right place. This open discussion will bring out your inner shinobi! We will have fun talking about anything from the fandom or anything with relation to. We're gonna have fun so stop on by!~","location":"Panel Room E","time":"03:00 pm"},"data":{"time":1405198800000,"tags":["Humor","Fan","Discussion"],"day":"Saturday"},"speakers":["EliseSiler","KelaBlackfox"]},"64":{"info":{"title":"Into the World of Digital Art","description":"Many people have seen the master pieces on Devianart, and many have wonder what goes on behind the scene. In this panel I will tell and show you how to get started in this world.You will learn from creating a work space to a finished sketch on your very own computer screen. From a freelance artist of 2 years to you.","location":"Panel Room E","time":"09:00 pm"},"data":{"time":1405220400000,"tags":["Discussion","Technology","Art"],"day":"Saturday"},"speakers":["EliseSiler","KelaBlackfox"]},"65":{"info":{"title":"AMV Creation","description":"AMV's has been a role part in our daily lives for most of us.Some people will even compete with their favorite anime and music. If you want to know how they create their videos,well that is where I come in.I will show you many things,ways,types,and effect you can use. Come on by and stay awhile. We'll have a ball!~","location":"Panel Room E","time":"11:00 pm"},"data":{"time":1405141200000,"tags":["Discussion","Technology"],"day":"Friday"},"speakers":["EliseSiler","KelaBlackfox"]},"68":{"info":{"title":"Going Medieval with the Society for Creative Anachronisms","description":"Join us for a fun-filled interactive  presentation of the S.C.A. historical reenactment group. The presentation will include costuming, styles of combat, dancing, heraldry, and historical arts and crafts, and much more medieval mayhem.","location":"Demo Area","time":"04:00 pm"},"data":{"time":1405116000000,"tags":["Humor","Cosplay","Discussion","Culture"],"day":"Friday"},"speakers":["JerryHerring","Honorable Lady AdaliaVonderberg","Baron and Baroness Morgan and MontegaBlackdragon"]},"69":{"info":{"title":"Improbable One Piece Theories","description":"What if Sanji at a Zoan fruit for the Flying Spaghetti Monster?\r\nWhat if the One Piece is the one piece of Buggy's body that nobody can find: His real nose\r\nWhat if Usopp is the long lost warrior/prince/prophet of the Ancient Long Nose Tribe and is the hero we need and deserve?\r\n\r\nIn this panel, we'll discuss and even come up with some of the most hilariously improbable One Piece fan theories!","location":"Panel Room D","time":"02:30 pm"},"data":{"time":1405197000000,"tags":["Humor","Fan","Discussion"],"day":"Saturday"},"speakers":["KennedyParker"]},"70":{"info":{"title":"The Horrifyingly Horrifying History of Horror in Anime","description":"Believe it or not, there's more to horror in anime than just Higurashi and Death Note! For example, did you know that the horror genre in anime has really strong roots in the mecha genre, and it's thanks to our giant robot friends that we have anime horror the way it is today? In this panel, we'll discuss the history of horror in anime, how it got to where it is today, and believe me, there are some pretty rad horror anime recommendations in it for you, too. And awesome points. There are lots of awesome points in it for you, too.","location":"Panel Room C","time":"12:00 am"},"data":{"time":1405058400000,"tags":["Fan","Discussion"],"day":"Friday"},"speakers":["KennedyParker"]},"71":{"info":{"title":"Shingeki...No Questions?","description":"This is a Q & A panel for Attack on Titan! Games will be played, prizes will be won, ships will be sailed, and feels will be felt. This panel will have some minor adult humor, so it's requested that you be 16+!  We will try to have a full cast of characters to answer your questions, however this is not set in stone. Cameras and videotaping will be welcomed, as long as it isn't a major distraction! We encourage you to interact with the characters as much as you'd like, but be careful...ask the wrong thing and you may be titan food....","location":"Panel Room D","time":"07:00 pm"},"data":{"time":1405126800000,"tags":["Humor","Cosplay","Fan","Discussion"],"day":"Friday"},"speakers":["Alex & JadeSchneiderman & Mangrum","AshleyDial"]},"72":{"info":{"title":"OK GUNPLA Meetup","description":"Oklahoma GUNPLA(Gundam Plastic) meetup!\r\nThis is a meetup for Gundam and GUNPLA fans of all ages and skill levels. Bring on the mecha!","location":"Panel Room D","time":"10:00 am"},"data":{"time":1405267200000,"tags":["Fan","Culture"],"day":"Sunday"},"speakers":["JayHolman","BretWilson","AaronMorrison"]},"73":{"info":{"title":"Monster Hunter Meetup","description":"Monster Hunter is one of the most popular video game series in Japan. Sadly, it's pretty unheard of elsewhere.\r\nLet's change that! Bring your 3DS, and let's get hunting!","location":"Panel Room E","time":"12:00 pm"},"data":{"time":1405188000000,"tags":["Fan"],"day":"Saturday"},"speakers":["JayHolman","JoeyDougherty","AaronHolman"]},"74":{"info":{"title":"Screenwriting/Comic Book Writing 101","description":"A look into the basics of screenwriting and comic book writing.","location":"Panel Room D","time":"10:00 am"},"data":{"time":1405180800000,"tags":["Discussion","Industry"],"day":"Saturday"},"speakers":["SamuelBruch"]},"77":{"info":{"title":"Twitch Plays Pokemon: A Look Into The Lore","description":"A in depth look at the lore of the social experiment: Twitch Plays Pokemon.  We will be looking at the lore, from Red Commanding Gods to the world of Johto, \"No Gods, Only Mon\", and gthe Social aspects of the game.","location":"Panel Room E","time":"07:00 pm"},"data":{"time":1405126800000,"tags":["Humor","Discussion","Culture"],"day":"Friday"},"speakers":["SamuelBruch"]},"81":{"info":{"title":"Attack on TNT 18+","description":"A Q&A for Attack on Titan, see who can gross Levi out the most, see Krista in a dress ( Don't touch Ymir will kill), contest to see who can make Annie laugh, keep away potato with Sasha, Marco Polo, and a contest to see who can piss off Eren the quickest. 18+","location":"Panel Room D","time":"11:00 pm"},"data":{"time":1405141200000,"tags":["Humor","Fan","Discussion"],"day":"Friday"},"speakers":["ErinFleming","LauraSikes","EmileePray"]},"82":{"info":{"title":"Free! For All","description":"A Q&A, scaring Mako contest, Do you know us well (the characters), a kiss for the winner, skits based off of ideas from the new members of the swim team( the audience), who's more shota, Nagisa or Nitori? Best Dolphin impression and who can send Rin off the edge?","location":"Panel Room E","time":"08:00 pm"},"data":{"time":1405130400000,"tags":["Humor","Fan","Discussion"],"day":"Friday"},"speakers":["MonicaFleming","LauraSikes","CourtneyWatson"]},"85":{"info":{"title":"Do's and Don't's of Buying Cosplay Online","description":"This panel will help to ease your mind when looking for cosplay costumes, wigs, and other accessories online. It will discuss the best websites to buy from, and also include fraud websites, and simple ways to check if the website you are buying from is authentic. It will also discuss good tips for making sure your cosplay will get here on time, and good tips when asking for commission costumes.","location":"Panel Room E","time":"01:00 pm"},"data":{"time":1405191600000,"tags":["Humor","Cosplay"],"day":"Saturday"},"speakers":["SandraTurney"]},"87":{"info":{"title":"All Over Armor","description":"Does your dream cosplay involve armor, but maybe you don't know where to start? Are you confounded by craft foam? Wondering about Worbla? Puzzled by paint? Well, look no further! \r\nJoin Erin Carpenter of Sparqy Cosplay on a magical journey through the wonderful world of cosplay armor making! In this panel you'll learn how to pattern armor to fit your body, choose your materials, assemble the pieces, give your armor the perfect paint job, and so much more for noobs and veterans alike!","location":"Panel Room C","time":"04:30 pm"},"data":{"time":1405117800000,"tags":["Cosplay"],"day":"Friday"},"speakers":["ErinCarpenter"]},"89":{"info":{"title":"Prop 'till You Drop!","description":"Now that you have your cosplay sewn, it's time to accessorize!\r\nCosplayers no longer need to limit themselves to cardboard shields and duct tape swords. There are a wealth of materials out there to create epic props without busting the bank! Come learn from Erin Carpenter of Sparqy Cosplay how to make props that are con safe, lightweight, durable, and most importantly - AWESOME!","location":"Panel Room C","time":"10:00 am"},"data":{"time":1405267200000,"tags":["Cosplay"],"day":"Sunday"},"speakers":["ErinCarpenter"]},"90":{"info":{"title":"An Ode to Quality","description":"A panel dedicated to laughing at unfortunate and cheap animation, terrible dubbing, hilariously incorrect subtitles, and terrible writing in anime. Including fan favorites such as Garzey's Wing, the Ghost Stories dub, yaoi hands, and \"People die when they are killed!\"","location":"Panel Room C","time":"10:30 pm"},"data":{"time":1405139400000,"tags":["Humor","Fan"],"day":"Friday"},"speakers":["KennedyParker"]},"93":{"info":{"title":"Anime Merch: The Stupid, The Funny, and the Useless","description":"Not all anime merchandise companies limit themselves to figures and plushies: Some have gone so far as to make everything from Fate/Zero plates, to Persona 4 nail filers, and Attack on Titan baked potatoes-- and that's only to name a few! This is a panel dedicated to the dumbest, most hilarious, most useless, most WHY WOULD YOU MAKE THAT anime merchandise around. Now featuring dumb looking bootleg anime figures!","location":"Panel Room C","time":"10:30 pm"},"data":{"time":1405225800000,"tags":["Humor","Fan"],"day":"Saturday"},"speakers":["KennedyParker"]},"94":{"info":{"title":"Patterning 101","description":"Want to make a cosplay but can't find the perfect pattern to use? Interested in learning how to make your own patterns? This panel will give demonstrations of how to use things you already have at home to create a perfect pattern for your next cosplay, as well as provide a Q&A time for specific patterning questions.","location":"Panel Room D","time":"08:00 pm"},"data":{"time":1405130400000,"tags":["Cosplay"],"day":"Friday"},"speakers":["TwilightCosplay"]},"95":{"info":{"title":"Midnight Gundam Madness!","description":"This is the year! They have heard our pleas and finally we have it, a mech theme to TnT! What better reason than to hold another MIDNIGHT GUNDAM MADNESS!! Join us as we discuss what's old, new and upcoming in the Gundam universe. Make new friends, reunite with old ones too! We'll also have prizes for trivia and best Gundam related cosplay at the panel, come on out!","location":"Panel Room C","time":"12:00 am"},"data":{"time":1405231200000,"tags":["Humor","Fan","Discussion","Culture"],"day":"Sunday"},"speakers":["JosephHix"]},"98":{"info":{"title":"D.gray-man","description":"We are a group who love d.gray-man! If you love it too then join the fun! We will hold a contest for those dressed as characters from either the manga or anime and can also include art books! Judging will be held by 3 judges & the audience! We will have a discussion and debate over characters we love and why! Fan boy&girl together and all out have fun! \r\nPrizes will be awarded through the panel for games participation and the contest itself! Be ready for clips of the best scenes, voice actor fauning and just a good time!","location":"Panel Room D","time":"01:30 am"},"data":{"time":1405150200000,"tags":["Cosplay","Fan","Discussion"],"day":"Saturday"},"speakers":["JasmineReed","BriannaDuke","DrewPatrum"]},"99":{"info":{"title":"Anime Pub Quiz","description":"Think you know all there is to know about anime? Enjoy playing trivia and making new friends? Looking for something to do after 9 that doesn't leave you feeling like Pedo-Bear's long lost, far creepier, twin? Then Anime Pub Quiz is for you. It's bar trivia with your favorite Japanese media twist. And no, we can't promise there won't be tentacles.","location":"Double Tree - Restaurant","time":"10:00 pm"},"data":{"time":1405224000000,"tags":["Humor","Fan"],"day":"Saturday"},"speakers":["CaseyMcGill","JenniferBrown"]},"102":{"info":{"title":"Astronomy in Japan","description":"Until relatively recently, Japan has been an isolationist nation. Only in the past few centuries has it opened its borders, allowing a surge of new information and ideas. Since then, Japan has reformed itself considerably, becoming a technological and scientific superpower.\r\n\r\nOne of the areas to which Japanese nationals have contributed greatly, is the field of astronomy. This lecture explores their contributions, from stellar formation to the Big Bang.","location":"Panel Room C","time":"03:30 pm"},"data":{"time":1405200600000,"tags":["Culture"],"day":"Saturday"},"speakers":["JonVoisey"]},"104":{"info":{"title":"Exorcist Discussion","description":"I'm not ...a human or a demon. But I WILL be...AN EXORCIST!! Now can you tell me who said this? Rin Okumura? If that's your guess than your right! Now your on your way to become a true Exorcist! \r\nCome fight Hellfire with Hellfire with us in our discussion of Blue Exorcist!","location":"Panel Room C","time":"03:00 pm"},"data":{"time":1405285200000,"tags":["Humor","Fan","Discussion"],"day":"Sunday"},"speakers":["EliseSiler","KelaBlackfox","JadenAustin"]},"105":{"info":{"title":"How Not to Draw Manga","description":"Oh, the classic \"How to Draw Manga\" books we've all seen on the shelves of our elementary school book fairs. They're not all helpful, in fact, most of them are quite the opposite. In this panel, we're going to be looking and laughing at some of the least helpful how-to-draw manga books. Not only will this panel make you feel MUCH better about your artistic skills, but there will also be a few helpful tips to improve them, too! (Don't worry, none of them are from the how-to-draw books)","location":"Panel Room D","time":"08:30 pm"},"data":{"time":1405218600000,"tags":["Humor","Art"],"day":"Saturday"},"speakers":["KennedyParker"]},"106":{"info":{"title":"Bento Basics","description":"Japanese bento (box) lunches are known for their nutritious composition and aesthetic appeal. Here, we’ll look at the elements of making a bento, including several suitable authentic recipes, and how they can be used to create a bento lunch.","location":"Panel Room C","time":"09:30 pm"},"data":{"time":1405135800000,"tags":["Culture"],"day":"Friday"},"speakers":["JonVoisey"]},"107":{"info":{"title":"No Hope Left: Resident Evil 7","description":"A discussion about the lead-up to Resident Evil 6 and its effect on the Resident Evil legacy. Why did Capcom choose to implement the changes in mechanics to 6? Where will the game mechanics and plot go from here? We will discuss all of our theories on the form and content that Resident Evil 7 will take. You will think, you will laugh, and you will cry. Vomit bags not provided.","location":"Panel Room E","time":"11:00 am"},"data":{"time":1405270800000,"tags":["Humor","Fan","Discussion"],"day":"Sunday"},"speakers":["WilliamKohler","SeamusHamilton","HaydenDay"]},"108":{"info":{"title":"Advanced Wig Sculpting","description":"Join Mythos Creations for a discussion about the methods used to sculpt an existing wig into a seemingly impossible design--from foamcore structures to extension wefting and more.","location":"Panel Room B","time":"10:00 am"},"data":{"time":1405267200000,"tags":["Cosplay","Guest"],"day":"Sunday"},"speakers":["MythosCreations"]},"109":{"info":{"title":"Cosplay Boot Camp","description":"Join Mythos Creations for an interactive panel and learn how to present yourself to judges and on stage, including posing, explaining your construction methods, and documenting progress. Includes audience practical application!","location":"Panel Room B","time":"02:00 pm"},"data":{"time":1405108800000,"tags":["Cosplay","Guest"],"day":"Friday"},"speakers":["MythosCreations"]},"110":{"info":{"title":"Intro to Cosplay Materials","description":"Join Mythos Creations to learn about the various materials used in cosplay, such as fabrics, Worbla, craft foam, Wonderflex, resin, clays, and more. Includes the debunking of myths, such as \"no satin,\" as well as physical examples of the materials for you to examine up close and personal!","location":"Panel Room B","time":"11:00 am"},"data":{"time":1405270800000,"tags":["Cosplay","Guest"],"day":"Sunday"},"speakers":["MythosCreations"]},"111":{"info":{"title":"Mythos Creations: Anything Goes Q&A","description":"Do you want to know how to make that extensive jewelry or hand-embroider those details on that costume you're planning to make? Or do you just want to ask for a great spaghetti recipe? Anything goes in this informal Q&A panel!","location":"Panel Room B","time":"01:30 pm"},"data":{"time":1405279800000,"tags":["Cosplay","Discussion","Guest"],"day":"Sunday"},"speakers":["MythosCreations"]},"112":{"info":{"title":"Swag Swap","description":"Have some old swag your a little tired of? Maybe a few well loved plushies you want to trade to a new home? We all have a few things from a con or two and sometimes we move on. An old fandom, moving, need space for your new swag? How about bringing those old goodies to the swag swap. Posters, plushies, artwork, anything a fan fans over that you want to trade. Look through peoples collections, make some trades and possibly some new friends!","location":"Panel Room D","time":"03:30 pm"},"data":{"time":1405200600000,"tags":["Fan"],"day":"Saturday"},"speakers":["RyanMannschreck"]},"113":{"info":{"title":"Welcome to Night Vale Dating Panel","description":"Kevin and Cecil come out of their radio studios to get the best (and the worst) of anime characters together. How long can we go without a supernatural situation?\" How's that","location":"Panel Room E","time":"08:00 pm"},"data":{"time":1405216800000,"tags":["Humor","Fan"],"day":"Saturday"},"speakers":["AudiePritchett","BryceNelson"]},"115":{"info":{"title":"Otome Games: The Real Game in You","description":"What is an otome game? Where can I play one? What should I do?!\r\nA.\tI know what otome games are, but would like to talk about them\r\nB.\tI love all these recent reverse harem animes coming out and want to know more\r\nC.\tBut…I’m a guy…is it okay?\r\nAll these routes take you to one place—an otome game panel!","location":"Panel Room D","time":"12:00 am"},"data":{"time":1405144800000,"tags":["Humor","Fan","Discussion"],"day":"Saturday"},"speakers":["AmandaWheeler","EricaBennett"]},"117":{"info":{"title":"VOCALOID-Palooza","description":"Love VOCALOID? Have you always wanted to hang out and play games with a VOCALOID? Well now's your chance! Our VOCALOID cosplay panelists are ready to entertain you with skits and games like, 'Name That Song', 'True or False; VOCALOID Edition' and 'Story time with Len and Rin.' Let's make memories to last a life time at VOCALOID-Palooza, see you there!","location":"Panel Room C","time":"11:00 am"},"data":{"time":1405184400000,"tags":["Humor","Cosplay","Fan"],"day":"Saturday"},"speakers":["BreAnnaBarfield","MandyMoore"]},"121":{"info":{"title":"A Paint Makng Demonstration, Watercolor","description":"Ever wonder what it takes to make watercolor paints? What's in it? Would it be economical for you to make your own? Come watch this demonstration and find out the answers!","location":"Panel Room C","time":"11:30 am"},"data":{"time":1405272600000,"tags":["Discussion","Art"],"day":"Sunday"},"speakers":["DestinyWest"]},"122":{"info":{"title":"The Book Publishing Business is Eating our Brains, and Other Adventures","description":"Falkor Publishing is Tulsa's one and only SciFi and Fantasy imprint. We launched just before Tokyo in Tulsa, in July of 2012.  Since then we've gotten a few titles under our belts, learned a few lessons, had a few successes, and many, *MANY* failures!  Through it all, we're very proud of the work we've done so far, and we would like to share some of our experiences, talk about the world of book publishing, and have a discussion with aspiring writers and those who are looking to have their books or artwork published.","location":"Panel Room C","time":"12:30 pm"},"data":{"time":1405189800000,"tags":["Industry","Guest"],"day":"Saturday"},"speakers":["CarlosMoreno","StevenMix"]},"124":{"info":{"title":"Poi and glowstringing","description":"A panel for all ages. Learn the basics of poi and glow stringing or watch a cool performance art form. A fun event that will show you how to make your own poi and spin with them too.","location":"Demo Area","time":"06:00 pm"},"data":{"time":1405123200000,"tags":["Art"],"day":"Friday"},"speakers":["BenBlack"]},"125":{"info":{"title":"The God Complex","description":"This panel takes a critical look at various characters in video games and anime who have what is commonly known as the god complex. We will analyze certain aspects of both their personalities and histories in order to find common links between them as well as interpret what the characters' disorders reveal about the overall meaning in their respective story arcs. A list of characters to be discussed include Wesker from Resident Evil, Vergil from DMC, and Black Star from Soul Eater. Ultimately, through the study of their disorders we will see a bit of ourselves and our own existential struggle with chaos, disappointment, and our own egos.","location":"Panel Room C","time":"02:00 pm"},"data":{"time":1405281600000,"tags":["Fan","Discussion","Culture","Art"],"day":"Sunday"},"speakers":["EricSmith"]},"127":{"info":{"title":"How Sexism Affects the Fandom Experience","description":"Free donuts will be provided at this exciting panel which encourages open discussion about pressing topics concerning the fandom experience. We will discuss the impacts of sexism and misogyny not only inflicted on female cosplayers and gamers, but all sexes and genders. Emphasis will be placed on the role it plays in the development and reception of media such as video games, comics, and anime. Leave your fedora at the door. Also donuts.","location":"Panel Room E","time":"01:00 pm"},"data":{"time":1405278000000,"tags":["Cosplay","Fan","Discussion","Culture","Industry"],"day":"Sunday"},"speakers":["PaigeNelson","ZeeSimkins","CorianZacher"]},"128":{"info":{"title":"Zombies: and the Fans Who Love Them","description":"Zombies: They're dead, they're bloody disgusting, and they eat brains.  End of story, right?  WRONG!  There's much more to be explored in the world of the undead, and we're here to show you that zombies are alive and well… well… ok you know what we mean.  What is it about zombies that continue to steal our hearts, and eat our brains?  Even after countless movies, games, and books, we're still clamoring for more.  We want to talk about what creativity is still out there to uncover, and what stories there are still to tell.","location":"Panel Room A","time":"04:00 pm"},"data":{"time":1405116000000,"tags":["Humor","Fan","Discussion"],"day":"Friday"},"speakers":["StevenMix","GeraldWhalen","CarlosMoreno"]},"129":{"info":{"title":"Kendo--Japanese Swordsmanship","description":"An overview of the history of swordsmanship in Japan, and its relationship to the modern practice of Kendo.","location":"Demo Area","time":"11:00 am"},"data":{"time":1405184400000,"tags":["Humor","Discussion","Culture","Art"],"day":"Saturday"},"speakers":["MichaelLindsey"]},"130":{"info":{"title":"Fighting like Samurai: Competition and the Way of the Warrior","description":"Seminar/symposium on the purpose and value of point-based tournaments and sparring in modern martial arts.","location":"Demo Area","time":"05:30 pm"},"data":{"time":1405207800000,"tags":["Humor","Discussion","Culture","Art"],"day":"Saturday"},"speakers":["BryanMosley","MichaelLindsey"]},"131":{"info":{"title":"Women of Anime","description":"Some of our brilliant guests talk candidly about what it’s like being a woman in the voice acting industry, share stories, and open up the panel at the end for open discussion and questions.","location":"TBA","time":""},"data":{"time":0,"tags":["Humor","Discussion","Industry","Guest"],"day":"TBA"},"speakers":["CheramiLeigh","TerriDoty","CynthiaCranz"]},"132":{"info":{"title":"Cards Against Humanity with Jeremy Inman 18+","description":"It’s just as irreverent as it sounds.","location":"Panel Room B","time":"11:30 pm"},"data":{"time":1405143000000,"tags":["Humor","Guest"],"day":"Friday"},"speakers":["JeremyInman"]},"133":{"info":{"title":"Fullmetal Alchemist/Brotherhood Q&A","description":"Do you want to know what it was like behind the scenes creating FMA? Want to talk about your favorite characters? The villains you love to hate? Almost anything goes in this informal Q&A panel.","location":"Panel Room A","time":"03:30 pm"},"data":{"time":1405114200000,"tags":["Discussion","Industry","Guest"],"day":"Friday"},"speakers":["WendyPowell"]},"134":{"info":{"title":"This Isn’t Even My Final Form: Voices of DBZ","description":"Our lovely voice actors talk about their experiences with DBZ over the years.","location":"Panel Room B","time":"12:00 pm"},"data":{"time":1405188000000,"tags":["Humor","Discussion","Industry","Guest"],"day":"Saturday"},"speakers":["CynthiaCranz","JeremyInman"]},"135":{"info":{"title":"Directing Anime","description":"What does it mean to direct an anime? How does the experience feel as opposed to acting and being directed? Is it difficult to maintain the vision of an anime while interjecting it with your own creative license? These questions and more will be answered at this panel.","location":"TBA","time":""},"data":{"time":0,"tags":["Discussion","Industry","Guest"],"day":"TBA"},"speakers":["JerryJewell","J. Michael Tatum"]},"136":{"info":{"title":"Voices of Black Butler","description":"Our residents of Phantomhive Manor discuss their experiences in the word of Black Butler.","location":"Panel Room A","time":"11:30 am"},"data":{"time":1405186200000,"tags":["Humor","Fan","Discussion","Industry","Guest"],"day":"Saturday"},"speakers":["J. MichaelTatum","JerryJewell","TerriDoty"]},"137":{"info":{"title":"Dude, I Think the World Conference Can Convene: Voices of Hetalia","description":"The voices of the Axis Powers share their experiences.","location":"Panel Room A","time":"02:00 pm"},"data":{"time":1405108800000,"tags":["Humor","Fan","Discussion","Industry","Guest"],"day":"Friday"},"speakers":["J. MichaelTatum","JerryJewell","CheramiLeigh"]},"138":{"info":{"title":"Voice Acting 101","description":"What does it take to get into the industry? Can anyone be a voice actor? What kind of training should one go through to become a VA? How does acting for anime differ from other genres such as video games? Is it easy to transition from acting to other roles behind the scenes such as producing or directing? All this and much more!","location":"Panel Room A","time":"03:30 pm"},"data":{"time":1405200600000,"tags":["Discussion","Industry","Guest"],"day":"Saturday"},"speakers":["TerriDoty","WendyPowell","JeremyInman"]},"139":{"info":{"title":"To You in 2000 Years: The Attack on Titan Voice Panel","description":"Eric Cherry and J. Michael Tatum, who acts as well as directs for the English dub, discuss what it’s like taking on one of the most popular anime in recent history.","location":"Panel Room A","time":"10:00 am"},"data":{"time":1405180800000,"tags":["Humor","Fan","Discussion","Industry","Guest"],"day":"Saturday"},"speakers":["J. MichaelTatum","EricCherry"]},"141":{"info":{"title":"The Fairy Tail Voice Panel","description":"Some of our voice actors briefly share their Fairy Tail experiences and open up the floor to Q&A.","location":"TBA","time":""},"data":{"time":0,"tags":["Humor","Fan","Discussion","Industry","Guest"],"day":"TBA"},"speakers":["CheramiLeigh","EricCherry","TerriDoty"]},"142":{"info":{"title":"Aces Wild: An Anything Goes Card Game with VAs 18+","description":"Cards are drawn from a deck. If it’s a number card, an audience member gets to ask a voice actor of their choice a question, and that actor must answer no matter how personal the question is. If the card is a face card, a VA may ask the next audience member anything they like and expect a candid response. Aces mean that EACH voice actor must answer the same question from an audience member. Laughter, embarrassment, pride, betrayal—this panel has it all!","location":"Panel Room A","time":"11:00 pm"},"data":{"time":1405227600000,"tags":["Humor","Guest"],"day":"Saturday"},"speakers":["CynthiaCranz","TerriDoty","JerryJewell"]},"143":{"info":{"title":"Fruits Basket Pictionary","description":"Two voice actors, members of the Sohma family, will host a round of Fruits-Basket-themed Pictionary for the audience. Whoever wins each round gets to initiate some Q&A with the actors.","location":"Panel Room B","time":"09:30 pm"},"data":{"time":1405222200000,"tags":["Humor","Fan","Art","Industry","Guest"],"day":"Saturday"},"speakers":["JerryJewell","WendyPowell"]},"144":{"info":{"title":"Akita: Samurai Guard Dogs--Natural Treasure of Japan","description":"Description: Come and meet the inspiration for the movie, \"Hachiko\" in living, breathing, furry, person! The akita, companion to samurai for generations, are here for your enjoyment.  Naya and Kuma, pureblood Japanese akita-ken, demonstrate and enlighten congoers.  Hosted by their humans, Samurai Dan and Jillian.","location":"Demo Area","time":"12:00 pm"},"data":{"time":1405188000000,"tags":["Humor","Discussion","Culture"],"day":"Saturday"},"speakers":["JillianCoglan","SamuraiDan"]},"145":{"info":{"title":"Way of the Samurai Stage Show","description":"Description: The almost mystical martial arts of Japan's greatest warriors, brought to life by professional martial artists.  Watch us present the Way of the Samurai, mixing combat and comedy in a dizzying trip to 16th century Japan.","location":"Panel Room A","time":"02:00 pm"},"data":{"time":1405195200000,"tags":["Humor","Discussion","Culture","Art"],"day":"Saturday"},"speakers":["SamuraiDan","JillianCoglan"]},"146":{"info":{"title":"Cards Against Humanities with Samurai Dan 18+","description":"Prepare to be offended...er, entertained! Late night fun at its finest, the Cards Against Humanity panel will take you where you have never been before...unless you're really, really demented! Samurai Jillian hosts this popular \r\n\r\nApples To Apples spin-off, where the otaku play the cards, and the guests judge the warped-ness of the answers and pick the winners.","location":"Panel Room B","time":"10:00 pm"},"data":{"time":1405224000000,"tags":["Humor","Guest"],"day":"Saturday"},"speakers":["SamuraiDan","JillianCoglan"]},"147":{"info":{"title":"History of Sharp Pointy Things","description":"Samurai battlefield weaponry displayed, explained and demonstrated by an expert in 16th century Japanese combat. Lecture features stunning visual aids(blades from 1400-1800) and a question and answer session for attendees.","location":"Demo Area","time":"02:30 pm"},"data":{"time":1405110600000,"tags":["Humor","Discussion","Culture","Guest"],"day":"Friday"},"speakers":["SamuraiDan","JillianCoglan"]},"148":{"info":{"title":"Your Universe Has a Hole In It","description":"Have you ever read a book or watched a movie, fallen in love with the make believe reality, and then had a character or environment go completely off the deep end and ruin it for you? Me too.  Come complain about it, and learn how to avoid making that mistake in your own writing and/or storytelling.","location":"Panel Room B","time":"01:30 pm"},"data":{"time":1405193400000,"tags":["Humor","Fan","Discussion","Guest"],"day":"Saturday"},"speakers":["SamuraiDan","JillianCoglan"]},"149":{"info":{"title":"Poltergeist Report – Official YYH Q&A","description":"Have the spirit detetcives of Yu Yu Hakusho do what they do best—solve your paranormal problems! Got a ghost? They’ll know what to do. And if they don’t, just maybe ask some questions about the anime.","location":"Panel Room A","time":"09:00 pm"},"data":{"time":1405134000000,"tags":["Humor","Fan","Discussion","Industry","Guest"],"day":"Friday"},"speakers":["CynthiaCranz","JeremyInman"]},"150":{"info":{"title":"FEMM Q&A","description":"The talented musical artists of FEMM will be here doing a Q&A!!","location":"Panel Room A","time":"02:00 pm"},"data":{"time":1405281600000,"tags":["Fan","Discussion","Guest"],"day":"Sunday"},"speakers":["The BandFEMM"]},"152":{"info":{"title":"Con Stories 18+","description":"Ever wonder what kinds of shenanigans go on behind the scenes at conventions? Get the dish here, uncut.","location":"Panel Room A","time":"10:00 pm"},"data":{"time":1405224000000,"tags":["Humor","Fan","Discussion","Industry","Guest"],"day":"Saturday"},"speakers":["EricCherry","JeremyInman","CynthiaCranz"]},"153":{"info":{"title":"Writing Across the Industries","description":"A panel devoted to talking about what it means to write for anime, for web shows, for gaming, and more—it will take an in depth look at the creative process of four unique and talented individuals.","location":"Panel Room B","time":"02:30 pm"},"data":{"time":1405283400000,"tags":["Discussion","Art","Industry","Guest"],"day":"Sunday"},"speakers":["StephenRadney-Macfarland","LukewarmMedia","TerriDoty"]},"154":{"info":{"title":"Pathfinder and the RPG Industry","description":"An exploratory panel looking at the role-playing game industry with a specific focus on Pathfinder, piloted by Pathfinder designer Stephen Radney-Macfarland.","location":"Panel Room B","time":"11:00 am"},"data":{"time":1405184400000,"tags":["Fan","Discussion","Technology","Guest"],"day":"Saturday"},"speakers":["StephenRadney-Macfarland"]},"155":{"info":{"title":"Elements of Design: Video games vs. Tabletop","description":"How do these two genres differ when it comes to design? How does one go about becoming a game designer anyway? What about the design makes a game irresistible to players? All these questions and more answered by a veteran from the gaming industry as well as talented new faces in the video game industry.","location":"Panel Room B","time":"03:00 pm"},"data":{"time":1405112400000,"tags":["Fan","Discussion","Technology","Guest"],"day":"Friday"},"speakers":["StephenRadney-Macfarland","LukewarmMedia"]},"156":{"info":{"title":"Terri Doty Up Close and Personal","description":"For this panel, everything’s on the table. Terri talks about her life, the industry, her hobbies, the undead, her career in audiobooks, as well as the world of voiceover outside the realm of anime.","location":"Panel Room B","time":"05:00 pm"},"data":{"time":1405206000000,"tags":["Humor","Fan","Discussion","Industry","Guest"],"day":"Saturday"},"speakers":["TerriDoty"]},"157":{"info":{"title":"Doctor Who Discussions in Time and Space","description":"How much do you know about Doctor Who? Turns out there's a lot that most people don't know! Learn some surprising things about the 50-year-old show and put in your two cents about the current and current writers, characters, and the new Doctor!","location":"Panel Room E","time":"10:00 am"},"data":{"time":1405267200000,"tags":["Fan","Discussion"],"day":"Sunday"},"speakers":["Friends of WhalesCosplay"]},"158":{"info":{"title":"Cosplay Contest","description":"Come see the contestants walk across the stage!!\r\n\r\nWinners will be announced at the end of the contest.","location":"Main Events","time":"06:00 pm"},"data":{"time":1405209600000,"tags":["Cosplay","Fan"],"day":"Saturday"},"speakers":["Tokyo in TulsaCosplay Staff"]},"159":{"info":{"title":"Meet the Artists","description":"Come meet TnT's guest artists - the Chalk Twins and Jerry Bennett! Jerry is the winner of this year's annual art contest. During this panel he will answer questions about his artwork, his years in the industry, and he may even do some sketches. Devon and Lexi (the Chalk Twins) are creating a 60 square foot piece of art during the weekend. They'll take a break during this panel to talk about their art background, some of the anime they've been following, pieces they've created over the past two years, and give a demonstration of their process for creating giant murals from chalk.","location":"Panel Room B","time":"10:00 am"},"data":{"time":1405180800000,"tags":["Fan","Discussion","Art","Guest"],"day":"Saturday"},"speakers":["ChalkTwins","JerryBennett"]},"160":{"info":{"title":"DDFT: Featuring  DJ's Izma, Bones and Infam0us","description":"Dance time!!!","location":"Main Events","time":"09:00 pm"},"data":{"time":1405220400000,"tags":["Industry"],"day":"Saturday"},"speakers":["Tokyo inTulsa"]},"161":{"info":{"title":"Guest Signing","description":"Get your items signed, only two items per guest per attendees.  \r\n\r\nAll voice actors will be present along with FEMM.  \r\n\r\nThe room will close 30 minutes before the end of the scheduled time.","location":"Main Events","time":"01:00 pm"},"data":{"time":1405191600000,"tags":["Industry","Guest"],"day":"Saturday"},"speakers":["Tokyo inTulsa"]},"162":{"info":{"title":"Guest Signing","description":"Get your items signed, only two items per guest per attendees. \r\n\r\nAll voice actors will be present along with FEMM. \r\n\r\nThe room will close 30 minutes before the end of the scheduled time.","location":"Main Events","time":"12:00 pm"},"data":{"time":1405274400000,"tags":["Industry","Guest"],"day":"Sunday"},"speakers":["Tokyo inTulsa"]},"163":{"info":{"title":"Opening Ceremonies","description":"Come find out what all will be going this year.","location":"Main Events","time":"05:00 pm"},"data":{"time":1405119600000,"tags":["Humor","Guest"],"day":"Friday"},"speakers":["Tokyo inTulsa"]},"164":{"info":{"title":"Closing Ceremonies","description":"Find out what we have in store for 2015. \r\n\r\nDon't forget that we like to give away prizes at the end of the convention!!","location":"Main Events","time":"05:00 pm"},"data":{"time":1405292400000,"tags":["Humor","Guest"],"day":"Sunday"},"speakers":["Tokyo inTulsa"]},"165":{"info":{"title":"Concert featuring FEMM and after party featuring DJ MaRia","description":"CONCERT!!!!","location":"Main Events","time":"09:00 pm"},"data":{"time":1405134000000,"tags":["Guest"],"day":"Friday"},"speakers":["Tokyo inTulsa"]},"166":{"info":{"title":"Cosplay Contest Streaming Room","description":"This room is for overflow of the main cosplay contest.  It will show a direct live feed of the contest that is happening in Main Events.","location":"Panel Room A","time":"06:00 pm"},"data":{"time":1405209600000,"tags":["Cosplay"],"day":"Saturday"},"speakers":["Tokyo inTulsa"]},"167":{"info":{"title":"Going Medieval with the Society for Creative Anachronisms","description":"Join us for a fun-filled interactive presentation of the S.C.A. historical reenactment group. The presentation will include costuming, styles of combat, dancing, heraldry, and historical arts and crafts, and much more medieval mayhem.","location":"Demo Area","time":"02:00 pm"},"data":{"time":1405281600000,"tags":["Fan","Discussion","Culture"],"day":"Sunday"},"speakers":["SCASociety for Creative Anachronisms"]},"168":{"info":{"title":"Going Medieval with the Society for Creative Anachronisms","description":"Join us for a fun-filled interactive presentation of the S.C.A. historical reenactment group. The presentation will include costuming, styles of combat, dancing, heraldry, and historical arts and crafts, and much more medieval mayhem.","location":"Demo Area","time":"10:00 am"},"data":{"time":1405180800000,"tags":["Fan","Discussion","Culture"],"day":"Saturday"},"speakers":["SCASociety for Creative Anachronisms"]},"170":{"info":{"title":"Game Development 101","description":"Game development is awesome. Everyone has had an idea for a game that people would play, but not everyone knows what steps are needed to turn that idea into something we can all play. Join members of Lukewarm Media as they explain the process of developing games and answer questions.","location":"Panel Room A","time":"09:30 pm"},"data":{"time":1405135800000,"tags":["Industry","Guest"],"day":"Friday"},"speakers":["LukewarmMedia"]},"171":{"info":{"title":"Primal Carnage: A Prehistoric Post Mortem","description":"Primal Carnage has had a long journey to reach its current state. Join members of the studio as they talk about the key experiences and events during the course of development aswell as what things they would have done differently if starting out today.","location":"Panel Room A","time":"01:00 pm"},"data":{"time":1405191600000,"tags":["Industry","Guest"],"day":"Saturday"},"speakers":["LukewarmMedia"]},"172":{"info":{"title":"Lolita Tea","description":"Open to the public at a cost of $15, which includes refreshments.  Here is the link to RSVP and pay for your tea. \r\n\r\nhttp://www.tokyointulsa.com/lolita-tea-parties/","location":"Double Tree - Restaurant","time":"02:00 pm"},"data":{"time":1405195200000,"tags":["Culture"],"day":"Saturday"},"speakers":["Blue VelvetCafe"]},"173":{"info":{"title":"Karaoke","description":"Sing your heart out!!","location":"Double Tree - Council Oak","time":"08:00 pm"},"data":{"time":1405130400000,"tags":["Humor","Culture"],"day":"Friday"},"speakers":["Tokyo inTulsa"]},"174":{"info":{"title":"Karaoke","description":"Come sing your heart out!!","location":"Double Tree - Council Oak","time":"08:00 pm"},"data":{"time":1405216800000,"tags":["Humor","Culture"],"day":"Saturday"},"speakers":["Tokyo inTulsa"]},"175":{"info":{"title":"Digital Art","description":"Would you like to know more about digital artwork?  If your answer was yes then you should come check out this panel.","location":"Panel Room A","time":"06:30 pm"},"data":{"time":1405125000000,"tags":["Technology","Art"],"day":"Friday"},"speakers":["MichaelSimmons","JonathanFowler"]}},"speakers":{"CarolynDavis":{"first":"Carolyn","last":"Davis","description":"Name: Carolyn Davis\r\nAge: 16\r\n~ is the manager of 4amcosplay","title":"Carolyn Davis","panels":["58","57"]},"DestinyWest":{"first":"Destiny","last":"West","description":"Hello! I'm Destiny West, a college student pursuing my Bachelor's of Art and my teaching certification at USAO. I've had the privilege of working with many art mediums while in pursuit of my degree and I love opportunities to share what I've learned. I'm a jack of all trades and practice in oil painting, watercolor, inks, screenprinting, ceramics, and glassblowing.","title":"Destiny West","panels":["121","28"]},"CynthiaCranz":{"first":"Cynthia","last":"Cranz","description":"One of our wonderful voice actors, a Tokyo in Tulsa first-timer.","title":"Cynthia Cranz","panels":["142","152","149","134","131"]},"TerriDoty":{"first":"Terri","last":"Doty","description":"Another one of our lovely VAs","title":"Terri Doty","panels":["142","156","141","138","136","131","153"]},"JerryJewell":{"first":"Jerry","last":"Jewell","description":"One of our talented voice actors. This is Jerry's first year at TnT","title":"Jerry Jewell","panels":["142","135","137","143","136"]},"MythosCreations":{"first":"Mythos","last":"Creations","description":"Mythos Creations is a small group of “hardcore” cosplay lovers, dedicated to faithfully re-creating our characters with an eye for detail (when we’re not baking ridiculous-looking cupcakes, walking our dogs, or playing copious amounts of Harvest Moon).","title":"Mythos Creations","panels":["108","109","110","111"]},"JillianCoglan":{"first":"Jillian","last":"Coglan","description":"Dan Coglan, a.k.a. “Samurai Dan” and his wife, Jillian are the acknowledged masters of marital... er, MARTIAL mayhem.  This dynamic duo travels the civilized portions of the U.S., bringing their unique show to curious and horrified audiences alike.","title":"Jillian Coglan","panels":["144","146","147","145","148"]},"SamuraiDan":{"first":"Samurai","last":"Dan","description":"Dan Coglan, a.k.a. “Samurai Dan” and his wife, Jillian are the acknowledged masters of marital... er, MARTIAL mayhem.  This dynamic duo travels the civilized portions of the U.S., bringing their unique show to curious and horrified audiences alike.","title":"Samurai Dan","panels":["144","146","147","145","148"]},"ErinCarpenter":{"first":"Erin","last":"Carpenter","description":"What started in 2005 with a modified blazer from Goodwill, a plaster battle axe, and six cans of pink hairspray has turned in to a passion for Bonner Springs, Kansas, based cosplayer, Erin Carpenter AKA Sparqy. At the beginning of her cosplay career, Erin tended towards sewing-based costumes but lately her interests have shifted to complicated armors. Her most recent cosplays have included leatherwork, extensive chainmaile, and armor and props made with a variety of materials and techniques.","title":"Erin Carpenter","panels":["87","89"]},"EliseSiler":{"first":"Elise","last":"Siler","description":"I started to create AMV back in 2010, and have greatly improved.Last year at Izumi-con I enter 5 entries. Sadly you can't beat 'I'm to Sexy.' I use Free for most of my works, so be warned.","title":"Elise Siler","panels":["65","104","64","62"]},"KelaBlackfox":{"first":"Kela","last":"Blackfox","description":"I will be helping Elise wit hall her panels. top on bye for all of them!~","title":"Kela Blackfox","panels":["65","104","14","64","62"]},"KennedyParker":{"first":"Kennedy","last":"Parker","description":"Kennedy Parker: Artist, horror movie enthusiast, peanut butter expert, the best dinosaur trainer in the galaxy, aspiring Lord of the Things, honorary Power Ranger, and has an existence sustained on the power of pure rock n' roll energy, and a longtime watcher of anime. One Piece and Shiki are her favorites. She's done panels at A-kon, Anime Boston, and she's proud of this being her second time doing panels at Tokyo in Tulsa!","title":"Kennedy Parker","panels":["90","93","105","69","70"]},"CaseyMcGill":{"first":"Casey","last":"McGill","description":"Just an anime fan who enjoys cosplay, IPAs, trivia, and the rich smell of mahogany.","title":"Casey McGill","panels":["99"]},"JenniferBrown":{"first":"Jennifer","last":"Brown","description":"Anime fan by day. Professional profanity artist by night.","title":"Jennifer Brown","panels":["99"]},"JonVoisey":{"first":"Jon","last":"Voisey","description":"Jon graduated with a degree in Astronomy from the University of Kansas in 2008. During his time there, Kansas was involved in its \"great evolution wars\". Shortly after Jon began at KU, the Kansas State Board of Education, in effort to push pseudoscience into science classrooms, redefined science, removing the requirement that explanations be testable. Attempting to understand and correct such public misunderstanding of science, Jon moved towards a focus on science outreach and education, touring talks at conventions across the country.\r\n\r\nHe was previously a contributor to the astronomy news website Universe Today. His writings there have been picked up by numerous other science news outlets including physorg and Astrobiology Magazine. He is certified to teach high school and middle school math and science but currently works in estate jewelry and antiques.","title":"Jon Voisey","panels":["102","106"]},"ErinFleming":{"first":"Erin","last":"Fleming","description":"Erin Fleming is 19 years old, goes to Rose State College, and is a recent congoer. She is outgoing, outspoken, and very caring. She loves any cosplayer and is ready to take then to the next level in panels. She has been going to cons since 2013 and this will be her third con.","title":"Erin Fleming","panels":["81"]},"LauraSikes":{"first":"Laura","last":"Sikes","description":"Laura Sikes is 22 years old, and goes to Rose State College. She is an artist and avid anime nerd. She has been going to cons since 2011.","title":"Laura Sikes","panels":["81","82","33"]},"EmileePray":{"first":"Emilee","last":"Pray","description":"Emilee Pray is 20 years old and goes to Rose State College. She is weird, creative, and sleepy. She has been going to cons since 2010 and this will be her 5th con.","title":"Emilee Pray","panels":["81"]},"AliciaGibson":{"first":"Alicia","last":"Gibson","description":"Alicia has been active in the doll community since 2005, joining her are Kea Synder and Jennifer Beacham. All three of these young ladies have extensive knowledge of the hobby and a diverse collection of Dollfie between them.","title":"Alicia Gibson","panels":["25","23","24","26","41","40"]},"KeaSnyder":{"first":"Kea","last":"Snyder","description":"","title":"Kea Snyder","panels":["25","23","26"]},"JenniferBeacham":{"first":"Jennifer","last":"Beacham","description":"","title":"Jennifer Beacham","panels":["25","23","24","26"]},"DemiGray":{"first":"Demi","last":"Gray","description":"Having worked as a professional actress since 2008, Demi has had several years of improv acting, stage acting, and acting a fool beneath her belt. She's been cosplaying for even longer, and takes pride when recreating her favorite characters in image and presentation. To keep up with her work, check out her site!","title":"Demi Gray","panels":["54","53","56"]},"JeremyInman":{"first":"Jeremy","last":"Inman","description":"Jeremy Inman is a renowned voice actor who has had roles in such anime as Fullmetal Alchemist and Dragonball Z.","title":"Jeremy Inman","panels":["132","152","149","134","138"]},"SuzySpecter":{"first":"Suzy","last":"Specter","description":"Specter is an multi-talented performer who has been showcasing her art and creations for over 20 years.. From dancing to fashion and everything in between, she places her own unique touch on the world, leaning heavily towards \"the darker side of things\". Known as a gaming enthusiast, her talents extend beyond the world of performance art into the vast universe of video games, movies, comics, cosplay and much more! Specter is also the host of her own youtube show, \"Specter Vision\" that takes you behind the scenes with bands, indie film makers, makeup artists and all kinds of people who inspire Specter's world!","title":"Suzy Specter","panels":["59","60"]},"MadiBlu":{"first":"Madi","last":"Blu","description":"A Tulsa native and cosplay enthusiast, Madi aka \"Blu\" has a love for all things Anime! With years of experience in the costuming world, she has extensive knowledge and expertise in wig craft, make up, and design. Both a dancer and a seamstress, she has made many creations come to life. Blu has studied Japanese and Fashion/Apparel Design at TCC/OSU","title":"Madi Blu","panels":["59","60"]},"Tokyo inTulsa":{"first":"Tokyo in","last":"Tulsa","description":"","title":"Tokyo in Tulsa","panels":["164","165","166","160","161","162","173","174","163"]},"RavenMichaelis":{"first":"Raven","last":"Michaelis","description":"A 5 year con goer who has a passion for gaming, anime, and cosplay just like everyone else!!","title":"Raven Michaelis","panels":["35","17","18","38","37"]},"EricCherry":{"first":"Eric","last":"Cherry","description":"Eric will be joined in this tell-all panel by Jeremy Inman and Cynthia Cranz.","title":"Eric Cherry","panels":["152","141","139"]},"AshleyKing":{"first":"Ashley","last":"King","description":"Ashley has been your Cosplay Chess host for the past three years. Each year she works to ensure that participants have the best experience possible while keeping it safe, sane, and fun.","title":"Ashley King","panels":["29","30"]},"Tokyo in TulsaCosplay Staff":{"first":"Tokyo in Tulsa","last":"Cosplay Staff","description":"Tokyo in Tulsa Cosplay Staff have been running the cosplay contest for the past 6 years!!!  Here's to another great year.","title":"Tokyo in Tulsa Cosplay Staff","panels":["158"]},"SpencerParks":{"first":"Spencer","last":"Parks","description":"My name is Spencer and I've been going to conventions for a few years now. I've enjoyed every second of my convention experience, and I'm looking forward to help making Tokyo in Tulsa as great as it can be in my own little way. I love cosplaying, and it's one of my favorite, if expensive, pastimes.","title":"Spencer Parks","panels":["20"]},"AaronBallinger":{"first":"Aaron","last":"Ballinger","description":"Aaron is the CEO and co-founder of Equinox Comics.  An Oklahoma native who is determined to showcase the state's most talented creators.","title":"Aaron Ballinger","panels":["42"]},"SherryDennison":{"first":"Sherry","last":"Dennison","description":"","title":"Sherry Dennison","panels":["30"]},"JasmineReed":{"first":"Jasmine","last":"Reed","description":"Jasmine has been cosplaying and going to conventions for 5 years as well, she has helped run panels and participated in tea parties and performances. She enjoys going to conventions, meeting new people, cosplaying, reading, and playing video games. She will be the panel's Lenalee Lee.","title":"Jasmine Reed","panels":["98"]},"BriannaDuke":{"first":"Brianna","last":"Duke","description":"Brianna has been cosplaying and going to conventions for 5 years. She also has ran and been in panels and performances, she loves cosplay, anime and gaming. She will be the panel's Lavi.","title":"Brianna Duke","panels":["98"]},"DrewPatrum":{"first":"Drew","last":"Patrum","description":"Drew is a 4 year con goer and cosplayer, he has ran panels ranging from My Little Pony all the way to Marvel. He loves to stay in character and acting. He will the panel's Kanda (Yuu-Chan!!).","title":"Drew Patrum","panels":["98"]},"MichaelSimmons":{"first":"Michael","last":"Simmons","description":"","title":"Michael Simmons","panels":["175"]},"JonathanFowler":{"first":"Jonathan","last":"Fowler","description":"","title":"Jonathan Fowler","panels":["175"]},"J. Michael Tatum":{"first":"J. Michael Tatum","last":"","description":"","title":"J. Michael Tatum ","panels":["135"]},"TiffanyShafer":{"first":"Tiffany","last":"Shafer","description":"Tiffany Shafer, also known as Scarlet Heart Cosplay, has been cosplaying for five years. An amateur armor builder and prop fabricator, lately she has been working on creating the various outfits of her favorite character Erza Scarlet of Fairy Tail.","title":"Tiffany Shafer","panels":["15"]},"TerriMcGuire":{"first":"Terri","last":"McGuire","description":"Also known as Teriyaki Tako, she loves to spend her time playing Final Fantasy 13 and working on different cosplays. Currently she is working on making the different versions of Juvia Lockser from Fairy Tail.","title":"Terri McGuire","panels":["15"]},"SandraTurney":{"first":"Sandra","last":"Turney","description":"Hi! My name is Sandra Turney. I'm 16 years old and I live in Owasso, OK. I love reading, and books, and fantasy, and anime, and manga, and well, you should get the picture. I have been told I'm a fun person to be around, and I love to make people laugh and smile. I've been cosplaying for about three years now, and have poured my heart into the subject. TnT was my first convention ever and I love going every year.","title":"Sandra Turney","panels":["85"]},"Friends of WhalesCosplay":{"first":"Friends of Whales","last":"Cosplay","description":"Centered out if Southwest Missouri, Friends of Whales Cosplay has been hosting and assisting panels at various cons since 2012. We love Doctor Who as well as countless other fandoms! This panel will be hosted by Allison, the group's founder.","title":"Friends of Whales Cosplay","panels":["157"]},"KeaSynder":{"first":"Kea","last":"Synder","description":"","title":"Kea Synder","panels":["24"]},"J. MichaelTatum":{"first":"J. Michael","last":"Tatum","description":"J. Michael will be joined by Jerry Jewell and Cherami Leigh.","title":"J. Michael Tatum","panels":["137","139","136"]},"CheramiLeigh":{"first":"Cherami","last":"Leigh","description":"","title":"Cherami Leigh","panels":["137","141","131"]},"StephenRadney-Macfarland":{"first":"Stephen","last":"Radney-Macfarland","description":"Stephen has worked on such titles as Pathfinder and D&D.","title":"Stephen Radney-Macfarland","panels":["155","154","153"]},"LukewarmMedia":{"first":"Lukewarm","last":"Media","description":"","title":"Lukewarm Media","panels":["155","170","171","153"]},"JadenAustin":{"first":"Jaden","last":"Austin","description":"I'm a small town girl who simply loves anime, mostly Blue Exorcist. My best friend Elise ( Kat) introduced me to this and I'm glade.","title":"Jaden Austin","panels":["104"]},"The BandFEMM":{"first":"The Band","last":"FEMM","description":"FEMM is an up and coming band from Japan, making their US debut at Tokyo in Tulsa.","title":"The Band FEMM","panels":["150"]},"BryanMosley":{"first":"Bryan","last":"Mosley","description":"Bryan Mosley sensei has been active in the martial arts community for nearly thirty years. He holds teaching ranks in Kendo, Aikido, Tai Chi, and Tactical Self-Defense. He has competed both regionally and nationally, securing various championships and titles including the prestigious Nabeshima Cup in 2005.","title":"Bryan Mosley","panels":["130"]},"MichaelLindsey":{"first":"Michael","last":"Lindsey","description":"Michael Lindsay is the captain of the Tulsa Kendo Club (Shin Sou Fu Kan Dojo) and has been practicing Kendo since 2004. His resume includes professionally teaching Kendo at TCC, competing twice in the US National Kendo Tournament, and attending various tournaments, seminars and camps all over the United States and Japan.","title":"Michael Lindsey","panels":["130","129"]},"MonicaFleming":{"first":"Monica","last":"Fleming","description":"Monica is 20 years old and goes to Rose State College. She is funny, outgoing, and loud when need be. She has been going to conventions since 2013.","title":"Monica Fleming","panels":["82","33"]},"CourtneyWatson":{"first":"Courtney","last":"Watson","description":"Courtney is 20 years old and goes to Rose State College. She is hyper, squeaky (like a guinea pig), and a fanfiction writer. She has been going to conventions since 2012.","title":"Courtney Watson","panels":["82","33"]},"RachelHipscraps":{"first":"Rachel","last":"Hipscraps","description":"Originally a Dallas darling, Rachel \"Hipscraps\" is a talented writer, costume designer, and photographer. Specializing in creating hand-sewn works of art for belly dancers, her attention to detail has made her name synonymous with quality and beauty. Every 'Hipscrap' is one of a kind! A fashion aficionado, she graduated from Washington High School For The Performing And Visual Arts, (B.T.W.H.S.P.V.A.) and currently operates a successful network of dancers and performers Transcendance Tulsa.","title":"Rachel Hipscraps","panels":["60"]},"WendyPowell":{"first":"Wendy","last":"Powell","description":"","title":"Wendy Powell","panels":["143","133","138"]},"AudiePritchett":{"first":"Audie","last":"Pritchett","description":"A normal guy who has been sucked into the world of anime.","title":"Audie Pritchett","panels":["12","113"]},"BryceNelson":{"first":"Bryce","last":"Nelson","description":"An up and coming manga and anime fan.","title":"Bryce Nelson","panels":["12","113"]},"JerryHerring":{"first":"Jerry","last":"Herring","description":"Jerry has been participating in recreating the current middle ages for over 20 years, and will be joined by a group of experienced and enthusiastic participants from the local S.C.A group.","title":"Jerry Herring","panels":["68"]},"Honorable Lady AdaliaVonderberg":{"first":"Honorable Lady Adalia","last":"Vonderberg","description":"Honorable Lady Adalia is the current Seneschal for the Barony of Northkeep, Tulsa's local chapter of the S.C.A.  As an avid costumer, performer of the Bardic arts, and herald Adalia enjoys sharing her interest in the current middle ages .","title":"Honorable Lady Adalia Vonderberg","panels":["68"]},"Baron and Baroness Morgan and MontegaBlackdragon":{"first":"Baron and Baroness Morgan and Montega","last":"Blackdragon","description":"Their Excellencies Baron and Baroness of Northkeep, they are the local nobility for the Tulsa chapter of the S.C.A. Baron Morgan is a skilled knight and Baroness Montega exhibits herbs and simples used in medieval cosmetic.","title":"Baron and Baroness Morgan and Montega Blackdragon","panels":["68"]},"SCASociety for Creative Anachronisms":{"first":"SCA","last":"Society for Creative Anachronisms","description":"","title":"SCA Society for Creative Anachronisms","panels":["167","168"]},"MikelLaRosa":{"first":"Mikel","last":"LaRosa","description":"Mikel is a fighting game player and one of the many frequent members of the Fighting Game Community, based in Tulsa, Oklahoma. His experience with fighting games dates back to the first time he played Tekken 3 on his PS1. He is also a moderator for the Dustloop forums, where he is the head moderator for all things in relation to BlazBlue: Chronophantasma character Kagura Mutsuki!","title":"Mikel LaRosa","panels":["55"]},"AiAnimeCosplay":{"first":"AiAnime","last":"Cosplay","description":"AiAnime Cosplay is a cosplay group based in Tulsa, Oklahoma.  We primarily produce short Hetalia and Kingdom Hearts CMV's and Sketches for YouTube.","title":"AiAnime Cosplay","panels":["31"]},"CosplayEverything":{"first":"Cosplay","last":"Everything","description":"we are a cosplay group out of Oklahoma City and really do Cosplay Everything hence the name.  We can't wait to present our first panel and join in the convention fun!","title":"Cosplay Everything","panels":["13"]},"BizYoung":{"first":"Biz","last":"Young","description":"","title":"Biz Young","panels":["13"]},"Mira(AiAnimeCosplay)":{"first":"Mira","last":"(AiAnimeCosplay)","description":"","title":"Mira (AiAnimeCosplay)","panels":["13"]},"PaigeNelson":{"first":"Paige","last":"Nelson","description":"This will be Paige Nelson's sixth year attending Tokyo in Tulsa, and after experiencing a poorly put together panel at an out of state convention involving a similar topic, she has decided to take matters into her own hands, and will take a more professional standing on the topics involved.","title":"Paige Nelson","panels":["127"]},"ZeeSimkins":{"first":"Zee","last":"Simkins","description":"This will be Zee's third Tnt. They have attended many panels but has never been a part of one. They are very passionate about social issues and is always striving to learn more. Zee will be attending OU starting in the fall.","title":"Zee Simkins","panels":["127"]},"CorianZacher":{"first":"Corian","last":"Zacher","description":"Corian Zacher's interest in gender studies began as a small child, where roles and perceptions of gender expression both amazed and disturbed her. This fascination grew as she began challenging these assumptions in daily life. She is currently a student at Oklahoma State University who has taken classes that explore some of the topics that will be discussed in the panel.","title":"Corian Zacher","panels":["127"]},"KrystalLong":{"first":"Krystal","last":"Long","description":"Hello, My name is Krystal and I am 20 years old and college student at Tulsa Community College! I am one of Hostesses for JFashion 101 Panel! I also cosplay, I am founder of a dance group, and Otaku! I have been studying Japanese Fashion since I was 13 years old (8 years) though I am not in one of the styles is because I put together outfits with each element of the trends I like. I will be debuting one of my outfits that I will be making at the panel, so I hope to see there! You get to see pictures of some of my Jfashion stuff I own :)! If you want to get hold of me before hand for some question my email is midnighttime14@gmail.com.","title":"Krystal Long","panels":["22"]},"GerranCoppin":{"first":"Gerran","last":"Coppin","description":"Graduate of Northeastern State University and librarian at the Muskogee Public Library. Founder and former president of the Northeastern State Anime Club. JRPG, Jmusic, and sewing otaku! \r\nLinks:\r\nhttp://ganbattesewing.tumblr.com\r\nhttp://excitablelibrarian.tumblr.com/\r\nwww.youtube.com/user/YokaiAkito\r\nyokaiakito@gmail.com","title":"Gerran Coppin","panels":["22","44","43"]},"KazumiShibuya":{"first":"Kazumi","last":"Shibuya","description":"A fangirl of K-pop and also a teacher of the genre.","title":"Kazumi Shibuya","panels":["39"]},"Blue VelvetCafe":{"first":"Blue Velvet","last":"Cafe","description":"","title":"Blue Velvet Cafe","panels":["172"]},"ChalkTwins":{"first":"Chalk","last":"Twins","description":"","title":"Chalk Twins","panels":["159"]},"JerryBennett":{"first":"Jerry","last":"Bennett","description":"","title":"Jerry Bennett","panels":["159"]},"JosephHix":{"first":"Joseph","last":"Hix","description":"Joseph has been a Gundam fan for many years and been bringing you this panel for almost as many, keeping the spirit and memory alive of those who originally thought up and brought you this idea.","title":"Joseph Hix","panels":["95"]},"JayHolman":{"first":"Jay","last":"Holman","description":"Just another Monster Hunter fanboy hoping to get fans together.","title":"Jay Holman","panels":["73","72","47"]},"JoeyDougherty":{"first":"Joey","last":"Dougherty","description":"And another MH fanboy!","title":"Joey Dougherty","panels":["73"]},"AaronHolman":{"first":"Aaron","last":"Holman","description":"AND ANOTHER!","title":"Aaron Holman","panels":["73"]},"AlexisThedford":{"first":"Alexis","last":"Thedford","description":"My name is Alexis Thedford and this will be my third time coming to TnT. I enjoy drawing, dancing, singing, and of course anime!","title":"Alexis Thedford","panels":["34"]},"N/A":{"first":"N/A","last":"","description":"","title":"N/A ","panels":["43","43"]},"WilliamKohler":{"first":"William","last":"Kohler","description":"William Kohler is the head of Train Wreck Studios; writer, director, actor, editor; producer of videos, podcasts, film(s), and just about everything--INCLUDING the kitchen sink. But he's also just a college student, so who cares?","title":"William Kohler","panels":["107"]},"SeamusHamilton":{"first":"Seamus","last":"Hamilton","description":"Seamus has been involved in online radio since his freshman year in high school and has since taken fun very seriously. He is currently the president of his college's radio club and wants to be a radio guy when he grows up. He assists in writing, acting, and podcasting at Train Wreck Studios. Actually, he does more than just assist, but no one ever listens. He's not the hero we deserve but he's the only one that works on weekends.","title":"Seamus Hamilton","panels":["107"]},"HaydenDay":{"first":"Hayden","last":"Day","description":"Hayden, aka \"The Dax,\" has been with Train Wreck Studios since its inception as a group of idiots in high school. Now he is the assistant director, writer, actor, and comedy consultant. You want funny? We got funny. Dragon Ball Z.","title":"Hayden Day","panels":["107"]},"BretWilson":{"first":"Bret","last":"Wilson","description":"A member and admin of OK GUNPLA, Bret is a prime example of mete-enthusiest!","title":"Bret Wilson","panels":["72"]},"AaronMorrison":{"first":"Aaron","last":"Morrison","description":"OK GUNPLA admin Aaron is a hard-core Gundam fan.","title":"Aaron Morrison","panels":["72"]},"AmandaWheeler":{"first":"Amanda","last":"Wheeler","description":"Amanda (better know as Diedie) is an avid cosplayer, music, & otome game fan. If you ever need to talk about music, dramas, or otome games--she is one of many to go gals. Diedie has recently started attending TnT her usual cons being ACEN, AFW, and Naka-kon. She is most often seen with her partner in crime, urka-bird, who leaves all panel designs and apps to Diedie.","title":"Amanda Wheeler","panels":["115"]},"EricaBennett":{"first":"Erica","last":"Bennett","description":"Urka-bird, welcomes her position as number two in regards to Diedie's panels.  She however, is the one who keeps Diedie on track! Urka is also a long time cosplayer and music fan,and is excited to attend TnT for the first time.","title":"Erica Bennett","panels":["115"]},"TwilightCosplay":{"first":"Twilight","last":"Cosplay","description":"Twilight Cosplay is run by cosplayer Kelcey King. She has been a cosplayer for more than seven years, and has been sewing and creating her own patterns from a very early age.","title":"Twilight Cosplay","panels":["94"]},"DyanaClaytor":{"first":"Dyana","last":"Claytor","description":"Dyana is the owner and founder of Plus!SizeCosplay on Facebook, they have been cosplaying since 2008 and have been featured on many websites such as: Southern Cospitality, Plus Sized Cosplayers in the USA, Global Cosplay Association, Cosplay in America and more!","title":"Dyana Claytor","panels":["46"]},"BenBlack":{"first":"Ben","last":"Black","description":"I have been spinning poi for around 7 years now and love sharing my art form with everyone.","title":"Ben Black","panels":["124"]},"LinzyTakahashi":{"first":"Linzy","last":"Takahashi","description":"I'm fun loving and outgoing.","title":"Linzy Takahashi","panels":["7","8","4"]},"MinaHendo":{"first":"Mina","last":"Hendo","description":"She's fun loving and a bit of a book worm.","title":"Mina Hendo","panels":["7","8","4"]},"KeraOtaku":{"first":"Kera","last":"Otaku","description":"She's fun loving and outgoing.","title":"Kera Otaku","panels":["7","8","4"]},"SamuelBruch":{"first":"Samuel","last":"Bruch","description":"Samuel Bruch is a senior from Pittsburg State University who has won multiple screenplay writing contests and is in the process of self publishing his first comic book.","title":"Samuel Bruch","panels":["74","77"]},"Alex & JadeSchneiderman & Mangrum":{"first":"Alex & Jade","last":"Schneiderman & Mangrum","description":"Alex and Jade are the co-creators of the cosplay group, CosplayWithACape. They've been cosplaying for three-five years. They've both seen this anime and read the manga, so they know what's what for Attack on Titan. They both have experience in panels, such as this one. They are both have acting experience, so making this panel believable should not be difficult!","title":"Alex & Jade Schneiderman & Mangrum","panels":["71"]},"AshleyDial":{"first":"Ashley","last":"Dial","description":"Ashley is our Mikasa, best friend to Alex & Jade. She has performed with the two other presenters, and has attended and performed in panels with Alex & Jade. She is a cosplayer as well, and a small background with improv acting.","title":"Ashley Dial","panels":["71"]},"RyanMannschreck":{"first":"Ryan","last":"Mannschreck","description":"A frequenter of many cons around the Midwest Ryan has quite the collection of fan swag. Since 2009 she has been collecting and enjoying the world of anime cons.","title":"Ryan Mannschreck","panels":["112"]},"TakeOne":{"first":"Take","last":"One","description":"Take One Productions  is an improv comedy group started in 2007, by the troupe’s Founder & Director, Cory Phillips. Since those early days, we have grown in size and popularity. We have been blessed with an awesome staff and even more amazing fans. In recent years, we have expanded from tiny local venues to massive nationwide performances. From Hawaii, to your local coffee shop, and all over in between, our shows are always a smashing success.\r\n\r\nEach member of Take One Productions has been genetically engineered to bring the maximum amount of entertainment to our stage. Our actors use their epic super powers to keep our audience ROFLOL (rolling on the floor laughing out loud.) You don’t want to miss an opportunity to see the amazing comedic talent put forth by TAKE ONE PRODUCTIONS. Whether you just want to watch improv happen or you’re interested in learning from the masters themselves, joining us for our shows and workshops is a must!”","title":"Take One","panels":["48"]},"CarlosMoreno":{"first":"Carlos","last":"Moreno","description":"Carlos Moreno is a local graphic designer, book publisher, community volunteer, entrepreneur, and magic bean buyer.  Carlos brings his experience in the magazine and newspaper industry, as well as a long successful career in graphic design in to the creation of Falkor Publishing, a tiny little sci fi & fantasy imprint based in Tulsa.","title":"Carlos Moreno","panels":["122","128"]},"StevenMix":{"first":"Steven","last":"Mix","description":"Steven Mix is a California-born genre fiction author. After suffering a traumatic brain injury in the military, he became obsessed with zombies and horror and now works to bring his darkness into the world in a fun and constructive way. His first novel, Goodbye from the Edge of Never, was released during the fall of 2013 by Falkor Publishing. Steve is currently working on the next book in the Edge of Never series, as well as a new cyberpunk murder mystery novel.","title":"Steven Mix","panels":["122","128"]},"EricSmith":{"first":"Eric","last":"Smith","description":"As an English major at Oklahoma State University, I have always loved interpreting film, books, and even video games. At last year's TnT I did a co-presentation with Bryan Loftis in the \"Dark Descent: a Journey into the Sublime\" under the alias Professor Shapely that got some decent interest and thought it would be cool to try a panel of my own this year.","title":"Eric Smith","panels":["125"]},"HeatherBall":{"first":"Heather","last":"Ball","description":"As a total nerd for handhelds, I've had a Nintendo system on me since I was 8. I've had a 3DS since they've been out, and I've upgraded to 3DS XL since they've come out as well. I dabble in various games for the 3DS, but I mostly play the Street Pass games. I games such as Animal Crossing, Zelda: Link Between Worlds, and Pushmo.","title":"Heather Ball","panels":["47"]},"BreAnnaBarfield":{"first":"BreAnna","last":"Barfield","description":"I'm BreAnna Barfield (aka Hat'N'Clogs Cosplay), I am sixteen years old, and I have been cosplaying since 2010. I live in a small town called Harrah, Oklahoma, where I have lived all my life. I attended my first convention this past November. I cosplay characters such as Hatsune Miku form VOCALOID and C.C from Code Geass.","title":"BreAnna Barfield","panels":["117"]},"MandyMoore":{"first":"Mandy","last":"Moore","description":"","title":"Mandy Moore","panels":["117"]},"GeraldWhalen":{"first":"Gerald","last":"Whalen","description":"Gerald Whalen (a.k.a. \"Razorwrist\") is a co-founding member of the Zombie Civil Rights group.  An experienced Theoretical Zombiologist, Whalen lectures nationwide on the subject of zombie-human relationships, and coping skills for both human and zombie culture groups. He is currently working on a project to conduct an ethnographic study of the fast walking zombies of Central Oklahoma, a project that has proven to be as of yet impossible.","title":"Gerald Whalen","panels":["128"]}}}